<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/B3QZi2B_QT0"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription="Game Developer ต้องอาศัยทักษะที่จำเป็นคือ การใช้โปรแกรมคอมพิวเตอร์ในการทำงานเป็นหลัก เช่น การเขียนโปรแกรม การเขียนโค้ด (coding) และต้องเข้าใจภาษาทางด้านการเขียนโปรแกรมและซอฟท์แวร์ต่างๆ เพื่อนำมาเขียนโปรแกรมให้เกมสามารถเล่นได้ตามหลักการที่กำหนดไว้จาก Game Designer และเพื่อให้การทำงานของเกมเป็นไปอย่างมีประสิทธิภาพและดูสมจริง สำหรับทักษะที่จำเป็น ได้แก่"
      :skills="[
        {
          title: 'เชี่ยวชาญด้านคอมพิวเตอร์',
          description:
            'พื้นฐานสำคัญของการเป็น Game Developer คือ ต้องใช้คอมพิวเตอร์ได้อย่างเชี่ยวชาญจนสามารถแก้ไขปัญหาต่างๆ ภายในระบบได้ ไม่ว่าจะเป็นเรื่องระบบเครือข่าย (network) ของคอมพิวเตอร์หรือฐานข้อมูลภายในตัวเกม',
          imgSrc: 'game-developer/เขียนโปรแกรม.png',
        },
        {
          title: 'ทักษะด้านการเขียนโปรแกรม',
          description:
            'ต้องมีความเข้าใจในเรื่องของการทำวัตถุภายในเกม และรู้จักการใช้ระบบที่สามารถทำให้วัตถุเคลื่อนไหวได้ อีกทั้งยังต้องใช้ภาษาเฉพาะทางในการเขียนโปรแกรม โดยส่วนใหญ่ภาษาที่ใช้ในด้านเกม ได้แก่ ภาษาซีชาร์ป (C#) เป็นภาษาโปรแกรมเชิงสร้างคำสั่ง ภาษาซีพลัสพลัส (C++) เป็นต้น',
          imgSrc: 'game-developer/เขียนโปรแกรม.png',
        },
        {
          title: 'ทำงานเป็นทีมได้',
          description:
            'สามารถทำงานร่วมกับผู้อื่นได้เป็นอย่างดี เพราะในการพัฒนาเกมแต่ละเกมต้องอาศัยความร่วมมือจากทีมต่างๆ ที่มีความเชี่ยวชาญเฉพาะด้าน',
          imgSrc: 'game-developer/ทำงานเป็นทีม.png',
        },
        {
          title: 'มีความสามารถในการสื่อสาร',
          description:
            'ทักษะการสื่อสารเป็นสิ่งสำคัญที่จะช่วยทำให้การทำงานเป็นทีมประสบความสำเร็จ เพราะ Game Developer จะต้องประสานงานและพูดคุยกับทีมต่างๆ เช่น Game Designer และ Director ให้เกิดความเข้าใจในงานที่ตรงกัน เช่น การอธิบายศัพท์เฉพาะทางด้านคอมพิวเตอร์ให้ทีมอื่นๆ เข้าใจ',
          imgSrc: 'game-developer/สื่อสาร.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/game-developer/character.png"
      :characterDetails="[
        'ชื่นชอบเกม มีความสนใจเกี่ยวกับเกมและเรื่องราวที่เกี่ยวข้อง',
        'มีสมาธิและความตั้งใจทำงาน สามารถทำงานที่มีรายละเอียดซับซ้อนและวิเคราะห์วางแผนอย่างเป็นระบบ',
        'มีจินตนาการ มีความคิดและจินตนาการใหม่ๆ ซึ่งจำเป็นต่อการสร้างสรรค์ผลงานในรูปแบบที่แตกต่างจากเดิม',
        'ทำงานเป็นทีมได้ สามารถสื่อสารความต้องการและรับฟังความเห็นของผู้อื่น',
        'มีความตั้งใจสูง เพราะต้องใช้เวลานานในการผลิตผลงาน',
      ]"
      roleImg="@/assets/job/game-developer/role.png"
      :roles="[
        {
          title: 'ทดลองเล่นเกม (Tester)',
          description: 'เพื่อหาข้อผิดพลาดระหว่างการเล่นและวัดระดับความสนุกของเกม',
        },
        {
          title: 'พูดคุยปรึกษา',
          description: 'ร่วมกันกับทีมงานที่เกี่ยวข้อง ก่อนส่งต่อไปยังทีมทำงานต่อไป',
        },
        {
          title: 'สร้างเกม',
          description: 'พัฒนาต่อยอดจากเกมเดิมหรือสร้างเกมใหม่ที่แตกต่าง',
        },
      ]"
      incomeDescription="รายได้เฉลี่ย 25,000-100,000 บาทต่อเดือน รายได้จะเพิ่มขึ้นตามทักษะ ประสบการณ์และผลงานที่ผ่านมา สำหรับสิทธิประโยชน์อื่นๆ จะเหมือนกับพนักงานบริษัททั่วไป เช่น ประกันสังคม ประกันสุขภาพ การอบรมทักษะต่างๆ เป็นต้น"
      :recommendLv="[
        `ค้นหาตัวเองให้เจอ พื้นฐานของการทำงานในทุกอาชีพคือ สำรวจตัวเองว่านอกจากจะมีความชอบในเกมแล้ว ยังต้องมีความชอบในด้านเทคโนโลยี การเขียนโปรแกรม เพราะเป็นงานที่ต้องอาศัยความรู้เฉพาะทางและการฝึกฝนทักษะในด้านการเขียนโปรแกรมจนเกิดความชำนาญ เพื่อให้มีพลังใจในการพยายาม<span style='white-space: nowrap'>ใฝ่หา</span>ความรู้  โดยอาจเริ่มต้นจากการหัดเขียนโปรแกรมเกมง่ายๆ ขึ้นมาก่อน เพื่อพิสูจน์ว่ามีความสุขกับงานนี้จริงๆ หรือไม่`,
        'ศึกษาข้อมูลที่เกี่ยวข้องกับอาชีพ ศึกษาดูว่าอาชีพนี้ต้องมีทักษะความรู้อะไรบ้าง จะต้องพบกับการทำงานในรูปแบบไหน มีบริษัทไหนบ้างที่อยากเข้าไปร่วมงาน แนวทางการพัฒนาสายอาชีพตรงตามแผนอนาคตหรือไม่',
        'ศึกษาด้านการเขียนโปรแกรม เนื่องจากอาชีพนี้อาศัยแค่มีใจรักและชื่นชอบในการเล่นเกมเพียงอย่างเดียวไม่ได้ แต่ต้องมีความรู้พื้นฐานที่จำเป็นในด้านการเขียนโปรแกรม',
        'ผลิตผลงานจริง ลงมือทำผลงานออกมา เช่น ลองออกแบบหรือต่อยอดเกมที่มีอยู่ในตลาดแล้ว โดยพิจารณาว่าอยากจะให้เกมเป็นอย่างไร มีจุดไหนในเกมที่ยังสามารถพัฒนาได้อีกบ้าง ซึ่งสิ่งที่สร้างสรรค์ผลงานออกมา สามารถเก็บเป็น portfolio ไว้ได้ เพื่อเป็นใบเบิกทางของอาชีพนี้',
      ]"
      recommendCourseDescription="ทักษะที่ใช้ในการทำงานของ Game Developer ประกอบไปด้วย ทักษะทางด้านคอมพิวเตอร์และโปรแกรมต่างๆ รวมถึงทักษะทางด้านไอทีมัลติมีเดีย เพื่อสร้างสรรค์และพัฒนาเกม ดังนั้นจึงมีความจำเป็นอย่างยิ่งที่จะต้องมีความรู้จากสาขาวิชาที่เกี่ยวข้องกับด้านคอมพิวเตอร์และการเขียนโปรแกรม ดังนี้"
      recommendImg="@/assets/job/game-developer/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: 'ด้านคอมพิวเตอร์',
          details: [
            {
              place: 'คณะเทคโนโลยีสารสนเทศและนวัตกรรม',
              courses: [],
            },
            {
              place: 'คณะวิทยาศาสตร์และเทคโนโลยี',
              courses: ['สาขาวิชา/ภาควิชาวิทยาการคอมพิวเตอร์'],
            },
            {
              place: 'คณะวิศวกรรมศาสตร์',
              courses: ['สาขาวิชา/ภาควิชาวิศวกรรมคอมพิวเตอร์'],
            },
          ],
        },
        {
          header: 'ด้านไอทีและมัลติมีเดีย',
          details: [
            {
              place: 'คณะมัณฑนศิลป์',
              courses: [],
            },
            {
              place: 'คณะศิลปกรรมศาสตร์',
              courses: [],
            },
            {
              place: 'คณะวิทยาการสารสนเทศ',
              courses: ['สาขาวิชา/ภาควิชานิเทศศิลป์'],
            },
            {
              place: 'คณะสถาปัตยกรรมศาสตร์',
              courses: [
                'สาขาวิชา/ภาควิชาการออกแบบนิเทศศิลป์',
                'สาขาวิชา/ภาควิชาการออกแบบสารสนเทศสามมิติ',
              ],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'

export default Vue.extend({
  name: 'GameDeveloper',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/game-developer/main.png'),
      title: 'นักพัฒนาเกม',
      subTitle: '(Game Developer)',
      description:
        'เป็นผู้อยู่เบื้องหลังการผลิตเกมออกสู่ตลาด โดยมีหน้าที่สร้างและพัฒนาระบบเกมในส่วนของการเขียนโปรแกรมและการเขียนโค้ด (coding) ต่างๆ เช่น การทำให้ภาพเคลื่อนไหวของเกมที่ออกแบบโดย Game Animator มีระบบวิธีการเล่นตามที่เขียนโปรแกรมไว้ การอัปเดตเวอร์ชันเกมให้มีความสอดคล้องกับเทคโนโลยีที่เปลี่ยนแปลงไป แก้ไขระบบโปรแกรมภายในเกมให้มีคุณภาพมากยิ่งขึ้น นอกเหนือจากเทคนิคในการสร้างเกมแล้ว ยังต้องมีความคิดสร้างสรรค์ในการออกแบบเกมให้มีความสมจริงอีกด้วย',
    }
  },
  head() {
    const instance: any = this

    return {
      title: 'อาชีพนักพัฒนาเกม',
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: instance.description,
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
