<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/7WQK9JL2kUA"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      :hasJobVariant="true"
      jobVariantTitle1="Game Artist 2D"
      jobVariantDescription1="ทำหน้าที่ออกแบบภาพร่างตัวละคร ฉาก และบรรยากาศในเกมออกมา เพื่อให้ทีมอื่นๆ เข้าใจคอนเซปต์ตรงกันว่าตัวละคร ฮีโร่ องค์ประกอบอื่นๆ เป็นแบบไหน มีลักษณะอย่างไร"
      jobVariantTitle2="Game Artist 3D"
      jobVariantDescription2="จะรับงานต่อจากฝั่ง 2D แล้วนำภาพร่างนั้นมาปั้นเป็นโมเดลสามมิติ (3D) ให้เห็นองค์ประกอบหลายด้าน เพราะในปัจจุบันเกมส่วนใหญ่จะมีรูปร่างหน้าตาเป็น 3D"
      skillMainDescription="อาชีพ Game Artist ทั้งประเภท 2D และ 3D ล้วนต้องใช้ความสามารถทางศิลปะและฝีมือในการสร้างสรรค์ผลงานบอกเล่าเรื่องราวในเกมออกมาเป็นภาพที่สวยงาม โดยทักษะที่สำคัญสำหรับอาชีพนี้ ได้แก่"
      :skills="[
        {
          title: 'ความรู้ด้านศิลปะ',
          description:
            'ต้องมีความรู้ความเข้าใจทฤษฎีศิลปะเป็นอย่างดี ได้แก่ ลายเส้น รูปร่าง รูปทรง สี แสงเงา และพื้นผิว ซึ่งล้วนมีความสำคัญในการวาดภาพและสร้างสรรค์ออกแบบมาเป็นผลงานที่สร้างสีสันอรรถรสในการเล่นเกม',
          imgSrc: 'game-artist/ความรู้ด้านศิลปะ.png',
        },
        {
          title: 'ความรู้รอบตัว',
          description:
            'อาชีพนี้ต้องอาศัยคลังความรู้และประสบการณ์ที่ได้พบเห็นมา เพื่อนำมาปรับใช้เป็นไอเดียในการออกแบบให้สมจริงมากที่สุด การได้พบเห็นสิ่งต่างๆ และการมีความรู้ที่หลากหลายจะทำให้นำไปต่อยอดการออกแบบได้มากขึ้น เช่น ถ้าต้องทำเกมแนวซอมบี้ แต่ไม่มีความรู้เกี่ยวกับซอมบี้ ไม่รู้รูปร่าง ก็อาจจะจินตนาการหรือสร้างสรรค์ผลงานออกมาไม่สมจริง',
          imgSrc: 'game-artist/ความรู้รอบตัว.png',
        },
        {
          title: 'ความคิดสร้างสรรค์',
          description:
            'Game Artist จำเป็นต้องมีความคิดสร้างสรรค์ เนื่องจากการออกแบบ เป็นเรื่องที่ต้องนำเสนอความเป็นจริง รวมไปถึงความเหนือจริงและโลกแห่งจินตนาการยิ่งสร้างให้เกิด ความแปลกใหม่ไม่เคยมีใครเห็นมาก่อน และใช้ความสร้างสรรค์มากเท่าไหร่ โอกาสเติบโตในสายอาชีพนี้ก็จะยิ่งเพิ่มมากขึ้นตามไปด้วย',
          imgSrc: 'game-artist/ความคิดสร้างสรรค์.png',
        },
      ]"
      :hasUniqueSkill="true"
      uniqueSkillHeader1="คุณสมบัติและทักษะเฉพาะของ GameArtist 2D (Skill)"
      uniqueSkill1Title1="วาดภาพเป็น"
      uniqueSkill1Description1="พื้นฐานการทำงานของ Game Artist 2D คือ ต้องมีทักษะในการวาดภาพ สเกตช์ภาพ เพื่อแสดงไอเดียต่างๆ ให้ออกมาเป็นรูปร่างอีกทั้งยังสามารถสื่อความหมายได้อย่างชัดเจน ทั้งนี้ยังเสริมความคิดและจินตนาการประกอบเข้าไปด้วยได้"
      uniqueSkill1Title2="โปรแกรมกราฟฟิก"
      uniqueSkill1Description2="โปรแกรมที่ใช้สำหรับ Game Artist 2D จะไม่ซับซ้อนเท่ากับ 3D โดยโปรแกรมที่จำเป็นจะต้องใช้งานได้เป็นอย่างดี ได้แก่ โปรแกรมตกแต่ง ปรับแก้ไขภาพเบื้องต้น (Adobe Photoshop) หรือ โปรแกรมสร้างรูปร่างกราฟิก เช่น (Adobe Illustrator) เป็นต้น เพื่อออกแบบส่วนประกอบพื้นฐานและรูปภาพต่างๆ ภายในตัวเกม"
      uniqueSkillHeader2="คุณสมบัติและทักษะเฉพาะของ GameArtist 3D (Skill)"
      uniqueSkill2Title1="โปรแกรมสร้างภาพ 3D"
      uniqueSkill2Description1="ต้องมีความรู้เรื่องโปรแกรมเฉพาะทางมากเป็นพิเศษ เพราะต้องทำชิ้นงานออกมาในรูปแบบ 3D เพื่อที่จะให้เห็นลักษณะโดยรวมทุกทิศทาง โปรแกรมพื้นฐานที่สำคัญสำหรับอาชีพ Game Artist 3D เช่น MAYA 3D Max และ Blender และยังมีโปรแกรมเสริมที่สามารถนำมาใช้ร่วมกับโปรแกรม 3D เช่น Photoshop Substance Designer และ ZBrush"
      characterChartImg="@/assets/job/game-artist/character.png"
      :characterDetails="[
        'ชื่นชอบการวาดภาพ โดยเฉพาะ Game Artist 2D',
        'มีเอกลักษณ์เฉพาะตัว มีรูปแบบการวาดที่เป็นเอกลักษณ์และโดดเด่น',
        'รู้จักการเข้าสังคม เข้ากับผู้อื่นได้ง่าย สามารถทำงานเป็นกลุ่มและรับฟังความคิดเห็นจากผู้อื่น',
        'ช่างสังเกต จับเอามุมมองที่มีต่อสิ่งต่างๆ มาประยุกต์ใช้กับงาน จับประเด็นและเรื่องที่สำคัญได้อย่างรวดเร็ว',
        'ตรงต่อเวลา ส่งงานตามเวลาที่กำหนด',
      ]"
      roleImg="@/assets/job/game-artist/role.png"
      :roles="[
        {
          title: '3D',
          description: 'นำแบบจาก Game Artist 2D มาสร้างสรรค์ต่อในรูปแบบ 3D',
        },
        {
          title: 'UX/UI',
          description:
            'ออกแบบลำดับการเข้าถึงเกม เมนูทั่วไป หรือการตั้งค่าเกมทั้ง User Experience (UX) และ User Interface (UI)',
        },
        {
          title: 'Poster',
          description: 'ออกแบบภาพโปสเตอร์ ป้ายแบนเนอร์ (banner)',
        },
        {
          title: 'ออกแบบ',
          description: 'เค้าโครงภาพของเกม ตัวละคร และภาพรวมของเกม',
        },
      ]"
      :incomeDescription="`
        <p>Game Artist 2D รายได้เฉลี่ย 15,000-25,000 บาทต่อเดือน</p>
        <p>Game Artist 3D รายได้เฉลี่ย 50,000 บาทขึ้นไปต่อเดือน</p>
        <p>Game Artist 2D และ 3D มีรายได้เฉลี่ยที่แตกต่างกัน ขึ้นอยู่กับประเภทการทำงาน หากเป็นพนักงานประจำจะได้รับเงินเดือนคงที่ในแต่ละเดือน แต่หากรับงานอิสระ (freelance) จะมีรายได้จากการออกแบบงานเป็นชิ้นหรือเป็นโปรเจกต์ ซึ่งรายได้เฉลี่ยของอาชีพนี้ขึ้นอยู่กับปัจจัยหลายๆ อย่าง ทั้งความสามารถและประสบการณ์ หากเป็นงานที่ต้องใช้ความรู้ความสามารถเฉพาะทาง เช่น Game Artist 3D ซึ่งมีการออกแบบงานปั้นหรืองานหล่อสามมิติ รายได้อาจจะสูงกว่า 50,000 บาท ต่อชิ้นงาน ถ้ามีฝีมือละเอียดและความชำนาญสูง รายได้อาจจะสูงกว่า 100,000 บาทขึ้นไปต่อชิ้นงาน</p>
      `"
      :recommendLv="[
        'ค้นหาตัวเองให้เจอ บันไดขั้นแรกในการก้าวสู่อาชีพ Game Artist คือ ต้องรู้ตัวก่อนว่าชอบออกแบบวาดรูปและใช้จินตนาการแบบไร้ขีดจำกัดหรือไม่ สไตล์การออกแบบที่ชอบเป็นแบบไหน ถนัดการวาดรูปแบบใด เพื่อค้นหาสไตล์ที่เป็นเอกลักษณ์ของตัวเอง โดยอาจเริ่มสำรวจฝีมือการวาดภาพหรือการออกแบบของตัวเอง แล้วหาข้อมูลจากเว็บไซต์ต่างๆ เพื่อค้นหาแนวทางในการออกแบบที่เป็นตัวเองมากที่สุด รวมทั้งดูตัวอย่างผลงานของนักออกแบบชื่อดังและเส้นทางอาชีพของพวกเขา เพื่อประเมินว่ามีความสนใจในอาชีพนี้จริงๆ',
        'ฝึกฝีมือ เมื่อรู้จักตัวเองแล้ว ต้องลงมือทำ สำหรับ Game Artist 2D อาจจะลองฝึกวาดภาพตัวละครในรูปแบบต่างๆ ส่วน Game Artist 3D ควรฝึกฝนการใช้โปรแกรมสามมิติ เช่น MAYA 3D Max หรือ Blender ซึ่งเป็นโปรแกรมพื้นฐานที่สามารถเข้าถึงได้ ค่อยๆ เรียนรู้ทีละขั้นตอนจนชำนาญ และเรียนรู้โปรแกรมอื่นๆ ต่อไป',
        'หาความรู้เพิ่มเติม เมื่อรู้จักตัวเองมากขึ้น ฝึกฝีมือจนชำนาญในระดับหนึ่ง ต้องเพิ่มพูนความรู้ความสามารถอื่นๆ โดยในปัจจุบันสามารถเรียนรู้ได้ง่ายๆ ผ่านช่องทางออนไลน์ เช่น เทคนิคการวาดรูป เทคนิคการออกแบบเกม หรือวิธีการสร้างเกม เพื่อที่จะได้เข้าใจขั้นตอนของการออกแบบเกมรูปแบบต่างๆ',
        'สะสมผลงาน ผลงานทุกชิ้นที่สร้างสรรค์ออกมา ล้วนเป็นผลงานที่สามารถนำไปต่อยอดในสายอาชีพได้ โดยสะสมเป็นผลงาน (portfolio) เพื่อเป็นเครื่องมือที่จะยืนยันความสามารถ ประสบการณ์ และความคิดสร้างสรรค์ สร้างโอกาสในการทำงานต่อไป',
      ]"
      recommendCourseDescription="จะเห็นได้ว่าทักษะที่สำคัญของ Game Artist 2D และ 3D คือ ทักษะด้านศิลปะ และทักษะการวิเคราะห์ ทำความเข้าใจในความต้องการของลูกค้าหรือ Game Designer ก็เป็นสิ่งสำคัญ นอกจากนี้ ยังต้องมีทักษะเพิ่มเติมเฉพาะทางอีกด้วย"
      recommendImg="@/assets/job/game-artist/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: 'สาขาวิชาสำหรับ Game Artist โดยทั่วไป',
          details: [
            {
              place: 'คณะสถาปัตยกรรมศาสตร์',
              courses: [
                'สาขาวิชา/ภาควิชาภาพพิมพ์และอิลลัสเตชั่น',
                'สาขาวิชา/ภาควิชาจิตรกรรมและมีเดียอาร์ต',
              ],
            },
            {
              place: 'คณะศิลปกรรมศาสตร์',
              courses: ['สาขาวิชา/ภาควิชาการออกแบบสื่อสาร'],
            },
            {
              place: 'คณะจิตรกรรมประติมากรรมและภาพพิมพ์',
              courses: [],
            },
            {
              place: 'คณะมัณฑนศิลป์',
              courses: [],
            },
          ],
        },
        {
          header: 'สาขาวิชาเฉพาะ สำหรับ Game Artist 2D',
          details: [
            {
              place: 'คณะศิลปกรรมศาสตร์',
              courses: ['สาขาวิชา/ภาควิชาการออกแบบอินเทอร์แอคทีฟและเกม'],
            },
            {
              place: 'คณะเทคโนโลยีสารสนเทศและนวัตกรรม',
              courses: [],
            },
          ],
        },
        {
          header: 'สาขาวิชาเฉพาะ สำหรับ Game Artist 3D',
          details: [
            {
              place: 'คณะวิศวกรรมศาสตร์',
              courses: [
                'สาขาวิชา/ภาควิชาเทคโนโลยีมีเดีย',
                'สาขาวิชา/ภาควิชาวิศวกรรมดิจิทัลมีเดียและระบบเกม',
              ],
            },
            {
              place: 'คณะเทคโนโลยีสารสนเทศและการสื่อสาร',
              courses: ['สาขาวิชา/ภาควิชาเทคโนโลยีดิจิทัลเพื่อการออกแบบ'],
            },
            {
              place: 'คณะสถาปัตยกรรมศาสตร์',
              courses: ['สาขาวิชา/ภาควิชาการออกแบบสนเทศสามมิติ'],
            },
            {
              place: 'คณะวิทยาศาสตร์และเทคโนโลยี',
              courses: ['สาขาวิชา/ภาควิชาเว็บและโมบายเทคโนโลยี'],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'

export default Vue.extend({
  name: 'GameArtist',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/game-artist/main.png'),
      title: 'เกมอาร์ตติส',
      subTitle: '(Game Artist)',
      description:
        'คือ อาชีพของผู้ที่ทำหน้าที่ออกแบบและวาดภาพองค์ประกอบต่างๆ ในเกมให้เห็นเป็นภาพที่สวยงามสมจริงหรือตามจินตนาการ อาทิ ฉากหลัง วิวทิวทัศน์ วัตถุต่างๆ ไม่ว่าจะเป็นยานพาหนะ อาวุธ บ้านเรือน สัตว์ รวมทั้งตัวละครและเครื่องแต่งกาย ให้ปรากฏเป็นภาพตามเรื่องราวในเกม โดยจะได้รับการมอบหมายงานการออกแบบจากเกมดีไซน์เนอร์ (Game Designer) ซึ่งจะเป็นผู้กำหนดความต้องการและเรื่องราวที่ต้องการนำเสนอ เพื่อให้ Game Artist ใช้จินตนาการและทักษะด้านศิลปะออกแบบให้ออกมาเป็นภาพ โดย Game Artist มี 2 ประเภท ได้แก่',
    }
  },
  head() {
    const instance: any = this

    return {
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: instance.description,
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
