<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/FuQka5qtz2k"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription="Game Animator เป็นอาชีพที่ต้องใช้ความรู้ความสามารถเฉพาะทาง เพื่อสร้างสรรค์ให้ภาพ วัตถุ หรือองค์ประกอบต่างๆ สามารถเคลื่อนไหวได้อย่างสมจริง ซึ่งต้องอาศัยทักษะดังต่อไปนี้"
      :skills="[
        {
          title: 'มีความชื่นชอบเกม',
          description:
            'ส่วนใหญ่คนที่ทำงานในวงการเกมจะชื่นชอบเรื่องราวที่เกี่ยวข้องกับเกมและการเล่นเกมเป็นพื้นฐาน ซึ่งจะทำให้เกิดความรู้และความเข้าใจในรูปแบบที่มีความเฉพาะเจาะจงของเกม เข้าใจถึงองค์ประกอบของเกมในแต่ละประเภท จึงทำให้สามารถทำงานด้วยความเข้าใจและยังสร้างเสน่ห์ให้กับการทำแอนิเมชันในเกมได้เพิ่มขึ้นด้วย',
          imgSrc: 'game-animator/ชื่นชอบเกม.png',
        },
        {
          title: 'มีความรู้เรื่องการออกแบบแอนิเมชัน',
          description:
            'ซึ่งเป็นพื้นฐานที่จำเป็นของการทำงานในสายอาชีพนี้ เนื่องจากจะต้องใช้ความรู้และวิธีการออกแบบต่างๆ มาใช้ในการทำงาน เช่น กฎ 12 ข้อของแอนิเมชัน (หลักวิธีการขึ้นรูปแอนิเมชัน) ซึ่งเป็นหลักในการทำให้ภาพเคลื่อนไหวมีความน่าสนใจ',
          imgSrc: 'game-animator/รู้เรื่องออกแบบแอนิเมชัน.png',
        },
        {
          title: 'เชี่ยวชาญการใช้โปรแกรมแอนิเมชัน',
          description:
            'ทักษะนี้ถือว่าเป็นสิ่งที่สำคัญที่สุดสำหรับ Game Animator เพราะควรที่จะรู้จักวิธีการใช้โปรแกรมสร้างรูปภาพธรรมดาทั้งแบบ 2D และ 3D ให้เคลื่อนไหวได้ โดยโปรแกรมที่นิยมใช้ ได้แก่ 3D Max และ MAYA',
          imgSrc: 'game-animator/เชี่ยวชาญโปรแกรมแอนิเมชัน.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/game-animator/character.png"
      :characterDetails="[
        'มีความชื่นชอบเกมและการ์ตูน โดยไม่จำกัดเฉพาะแค่เกมหรือการ์ตูนแนวแอนิเมชันเท่านั้น',
        'มีความตั้งใจสูง เพราะต้องใช้เวลานานในการผลิตผลงาน',
        'ชอบทดลองทำสิ่งใหม่ๆ อยากเรียนรู้สิ่งใหม่ๆ และทดลองทำ',
        `เข้ากับผู้อื่นได้ง่าย มีมนุษยสัมพันธ์ที่ดี เพราะต้องทำงานร่วมกับ<span style='white-space: nowrap'>ทีม</span>อื่นๆ`,
        'เปิดรับสิ่งใหม่ๆ อยู่เสมอ ชอบศึกษาหาความรู้ และสนใจสิ่งใหม่ๆ ที่เกิดขึ้นรอบตัว',
      ]"
      roleImg="@/assets/job/game-animator/role.png"
      :roles="[
        {
          title: 'ค้นคว้าหาข้อมูลและแรงบันดาลใจ',
          description: 'เพื่อให้ผลงานมีความแปลกใหม่และน่าสนใจ',
        },
        {
          title: 'ประชุมทีม',
          description: 'เพื่อทำความเข้าใจเกี่ยวกับการสร้างสรรค์ผลงาน',
        },
        {
          title: 'ทำแอนิเมชัน',
          description: 'ระยะเวลาในการทำงานขึ้นอยู่กับขนาดของงาน ตั้งแต่ 3 เดือน ถึง 1 ปี',
        },
      ]"
      incomeDescription="รายได้เฉลี่ย 15,000 บาทขึ้นไปต่อเดือน หากเป็นพนักงานประจำจะได้รับเงินเดือนที่คงที่ในแต่ละเดือน โดยเรทรายได้สำหรับนักศึกษาที่เพิ่งเรียนจบ จะมีรายได้อยู่ที่ 15,000-25,000 บาทต่อเดือน และรายได้จะเพิ่มขึ้นตามประสบการณ์และผลงานที่ผ่านมา สำหรับสิทธิประโยชน์อื่นๆ จะเหมือนกับพนักงานบริษัททั่วไป เช่น ประกันสังคม ประกันสุขภาพ การอบรมทักษะต่างๆ เป็นต้น แต่หากรับงานอิสระ (freelance) จะไม่ได้รับเงินเดือน แต่มีรายได้จากการออกแบบงานเป็นชิ้นหรือเป็นโปรเจกต์ ซึ่งรายได้เฉลี่ยของอาชีพนี้ขึ้นอยู่กับปัจจัยหลายๆ อย่าง ทั้งความสามารถและประสบการณ์"
      :recommendLv="[
        'รู้จักตัวเองว่าชอบอะไร ควรสำรวจตัวเองว่าเป็นคนที่มีความสนใจเรื่องการออกแบบ การทำงานที่มีรายละเอียดซับซ้อน ต้องใช้ความคิดเยอะ และมีความสนใจโลกของเกมและการ์ตูนซึ่งทำให้ได้ใช้จินตนาการและความคิดสร้างสรรค์เป็นอย่างมากหรือไม่ หลังจากนั้นจึงมาสู่ขั้นตอนของการศึกษาและวางแผนในการประกอบอาชีพนี้',
        `สร้างพื้นฐานความรู้ ด้วยการเรียนในสาขาวิชาที่เกี่ยวข้องกับการออกแบบ เทคโนโลยีการสร้างแอนิเมชัน เพื่อให้มีพื้นฐาน<span style='white-space: nowrap'>ความรู้</span>`,
        'เรียนรู้ไปพร้อมๆ กับการลงมือทำ เริ่มจากร่างภาพตัวละครตามความคิดและจินตนาการ แล้วลองนำมาปรับให้เป็นภาพเคลื่อนไหว โดยหาความรู้เพิ่มเติมจากแหล่งต่างๆ เช่น เว็บไซต์ หรือ Youtube เพื่อฝึกฝนการทำไปเรื่อยๆ',
      ]"
      recommendCourseDescription="ทักษะของอาชีพ Game Animator ที่จำเป็น ได้แก่ ทักษะทางด้านแอนิเมชัน และทักษะทางด้านเกม ซึ่งจะศึกษากฎเกณฑ์พื้นฐานของเกม รายละเอียดเชิงลึกและกระบวนการผลิตเกม โดยมีสาขาที่เปิดสอนเฉพาะในทั้ง 2 ด้าน ดังนี้"
      recommendImg="@/assets/job/game-animator/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: 'ด้านแอนิเมชัน',
          details: [
            {
              place: 'คณะวิทยาศาสตร์และเทคโนโลยี',
              courses: [],
            },
            {
              place: 'คณะดิจิทัลมีเดีย',
              courses: ['สาขาวิชา/ภาควิชาคอมพิวเตอร์แอนิเมชัน'],
            },
            {
              place: 'คณะเทคโนโลยีสารสนเทศและการออกแบบ',
              courses: ['สาขาวิชา/ภาควิชาเทคโนโลยีสารสนเทศเพื่อการออกแบบ'],
            },
            {
              place: 'วิทยาลัยศิลปะ ',
              courses: ['สาขาวิชาแอนิเมชันและวิชวลเอฟเฟกต์'],
            },
          ],
        },
        {
          header: 'ด้านเกม',
          details: [
            {
              place: 'คณะวิทยาศาสตร์และเทคโนโลยี',
              courses: [
                'สาขาวิชา/ภาควิชาเทคโนโลยีมีเดีย',
                'สาขาวิชา/ภาควิชาการออกแบบเชิงนวัตกรรม',
              ],
            },
            {
              place: 'คณะเทคโนโลยีสารสนเทศ',
              courses: [
                'สาขาวิชา/ภาควิชาคอมพิวเตอร์เกมและมัลติมีเดีย',
                'สาขาการพัฒนาสื่อประสมและเกม',
              ],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'

export default Vue.extend({
  name: 'GameAnimator',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/game-animator/main.png'),
      title: 'เกมแอนิเมเตอร์',
      subTitle: '(Game Animator)',
      description:
        'การที่ตัวละครในเกมสามารถเคลื่อนไหว เดิน วิ่ง หรือกระโดดและทำท่าทางต่างๆ ได้อย่างสวยงาม ล้วนเกิดขึ้นจากฝีมือของ เกมแอนิเมเตอร์ (Game Animator) ซึ่งเป็นผู้สร้างสรรค์ผลงานสามมิติให้สามารถเคลื่อนไหวได้ โดยต่อยอดงานจาก Game Artist ที่มีการวาดภาพกราฟิก 2D และ 3D ออกมา ด้วยการใช้โปรแกรมออกแบบใส่เทคนิคต่างๆ เข้าไปให้ตัวละครแต่ละตัวในเกมเคลื่อนไหวและมีความสามารถในการทำสิ่งต่างๆ ได้สมจริงตามจินตนาการ เรียกได้ว่า Game Animator เป็นอีกหนึ่งอาชีพที่ปลุกชีวิตให้เกม เพื่อสร้างประสบการณ์ที่สนุก ตื่นเต้น ให้กับผู้เล่น',
    }
  },
  head() {
    const instance: any = this

    return {
      title: 'อาชีพเกมแอนิเมเตอร์',
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: instance.description,
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
