<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/nepRFwZ91-E"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      :skills="[
        {
          title: 'การเขียนโปรแกรม',
          description:
            'ทักษะเกี่ยวกับการเขียนโปรแกรมด้วยภาษา C#, C++ และรู้จักวิธีการใช้งาน Engine ซึ่งเป็นเครื่องมือที่ช่วยในการสร้างเกมให้สอดคล้องกับเทคโนโลยี AR/VR เช่น ซอฟต์แวร์ Unity, Unreal Engine เป็นต้น',
          imgSrc: 'game-arvr-developer/เขียนโปรแกรม.png',
        },
        {
          title: 'ทักษะด้านมัลติมีเดียดีไซน์และแอนิเมชัน',
          description:
            'ต้องมีการเรียนรู้และฝึกฝนในการทำมัลติมีเดียดีไซน์ เพราะต้องทำควบคู่กันไปกับการเขียนโปรแกรม ในบางองค์กร นักพัฒนาจะต้องมีทักษะของเรื่องการคำนวณ การวางแผน การทำโมเดลตัวละครเกมในแบบ 2D และ 3D ผ่านโปรแกรม 3D Max และ MAYA เพื่อให้โมเดลตัวละครและฉากมีความสมจริง และทำงานได้ราบรื่นในการเล่นตลอดทั้งเกม',
          imgSrc: 'game-arvr-developer/มัลติมีเดีย.png',
        },
        {
          title: 'มีความเข้าใจในเทคโนโลยี AR/VR',
          description: `
        จะต้องมีการเรียนรู้และฝึกฝนเพิ่มเติมในเรื่องเทคโนโลยี AR/VR เพิ่มเติมเข้าไปด้วย โดยสิ่งหลักๆ ที่จะต้องรู้ ก็คือ
        <ul class='pl-4 mt-3 text-left'>
          <li>แพลตฟอร์มการใช้งาน เทคโนโลยี AR/VR สามารถใช้งานผ่านอุปกรณ์ Device อะไรได้บ้าง และแต่ละอย่างจะทำงานแบบไหน AR สามารถดูผ่านอะไรได้บ้าง VR มีกี่แบบ</li>
          <li>วิธีการเชื่อมต่อ จะเขียนโปรแกรมอย่างไรให้ระบบของเราเข้าไปเชื่อมต่อกับอุปกรณ์ที่เป็นฮาร์ดแวร์เหล่านั้นได้</li>
        </ul>
      `,
          imgSrc: 'game-arvr-developer/รู้เรื่อง arvr.png',
        },
        {
          title: 'มีความเข้าใจในเรื่อง User Experience',
          description:
            'เทคโนโลยี AR/VR ผู้ใช้งานจะต้องมีการใช้งานผ่านอุปกรณ์ Device ที่ไม่ใช่แค่คอมพิวเตอร์หรือสมาร์ทโฟน แต่อาจจะต้องมีการใช้งานผ่านแว่น VR ผ่าน Projector และอื่นๆ นักพัฒนาจึงต้องมีความเข้าใจอย่างลึกซึ้งในเรื่องประสบการณ์ที่ดีในการเล่นเกมบนอุปกรณ์ AR/VR ต้องพยายามค้นหาข้อจำกัดและจุดบกพร่องของเทคโนโลยี AR/VR โดยสิ่งที่จะต้องคำนึงถึงมากเป็นพิเศษก็คือ การแสดงผล ผลข้างเคียง และความสะดวก',
          imgSrc: 'game-arvr-developer/user exp.png',
        },
        {
          title: 'ทักษะด้านภาษา',
          description:
            'จะต้องมีทักษะในเรื่องภาษาอังกฤษโดยเฉพาะการอ่านและการแปล เพราะข้อมูลหรือสื่อที่จะนำมาเรียนรู้ศึกษาเพื่อพัฒนาตนเองหรือแก้โจทย์ต่างๆ นั้น ส่วนใหญ่จะเป็นข้อมูลจากต่างประเทศแทบทั้งหมด',
          imgSrc: 'game-arvr-developer/ภาษาต่างประเทศ.png',
        },
        {
          title: 'การสื่อสารและการปรับตัว',
          description:
            'เพราะต้องทำงานประสานกับกับหลายฝ่ายในทีม ดังนั้น จะต้องมีทักษะในการสื่อสารที่ดี สามารถอธิบายอะไรที่ยากให้เข้าใจได้ง่าย และจะต้องมีทักษะในการปรับตัวในการทำงานร่วมกันเป็นทีม รู้จักแบ่งเวลา และแบ่งหน้าที่',
          imgSrc: 'game-arvr-developer/สื่อสาร.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/game-arvr-developer/character.png"
      :characterDetails="[
        'ชอบเรียนรู้สิ่งใหม่ ชอบศึกษาหาความรู้ และสนใจสิ่งใหม่ๆ ที่เกิดขึ้นรอบตัวอยู่เสมอ',
        'ชื่นชอบเทคโนโลยี มีความสนใจในเรื่องของเทคโนโลยีและการพัฒนาตนเอง',
        'มีความมุ่งมั่นสูง ในการทำสิ่งต่างๆ อย่างไม่ย่อท้อแม้จะไม่ประสบความสำเร็จ พร้อมที่จะสลัดความล้มเหลวทิ้งและเดินหน้าต่อทันที',
        'นักแก้ปัญหา สนุกกับการแก้โจทย์ปัญหา สามารถคิดทุกอย่างเป็นตรรกะได้ เพราะเรื่องเทคโนโลยีกับการทำงานจริงมีปัญหาให้แก้ตลอดเวลา',
        'ใช้งาน AR/VR ได้แบบไร้ข้อจำกัด เพราะการจะเป็นนักพัฒนาด้านนี้ก็จะต้องนำตัวเองเข้าไปทดลองใช้งานด้วย ',
      ]"
      roleImg="@/assets/job/game-arvr-developer/role.png"
      :roles="[
        {
          title: 'พัฒนาเกม',
          description: 'ที่ใช้กับเทคโนโลยี AR/VR โดยเฉพาะ',
        },
        {
          title: 'User Experience',
          description:
            'มีความเข้าใจในเรื่องประสบการณ์ที่ดีในการเล่นเกมบนอุปกรณ์ AR/VR ของผู้ใช้งาน',
        },
        {
          title: 'Office hours',
          description: 'ชั่วโมงการทำงานเหมือนกับพนักงานบริษัททั่วไป',
        },
      ]"
      incomeDescription="รายได้โดยเฉลี่ยตั้งแต่นักศึกษาจบใหม่ไปจนถึงผู้ปฏิบัติงานมืออาชีพก็จะอยู่ที่ 20,000 - 40,000 บาท ส่วนโบนัสและสวัสดิการอื่นๆ ก็เป็นตามข้อตกลงและเงื่อนไขของแต่ละบริษัท"
      :recommendLv="[
        'Passion ความชื่นชอบในลักษณะงาน คือสิ่งที่ต้องมีเพราะเป็นสิ่งที่ช่วยให้ก้าวข้ามอุปสรรคต่างๆ ที่คุณเจอระหว่างทางได้',
        'เรียนรู้ความต้องการของกลุ่มเป้าหมาย ตีโจทย์ความต้องการของสังคมให้แตก สนุกกับการพัฒนาเป็นสิ่งที่ดี แต่ก็คงไม่เพียงพอถ้าสิ่งที่เราพัฒนาขึ้นมานั้นไม่ได้ตอบโจทย์ความต้องการของผู้คนและสังคม ถ้าจะก้าวไปในสายอาชีพนี้อย่างมั่นคงก็จะต้องพัฒนาในสิ่งที่ตอบโจทย์ความต้องการของผู้คนในสังคมได้ด้วย',
        'การสื่อสารและการปรับตัว การทำงานในด้านนี้ไม่ใช่จะอยู่ในโลกของตัวเองเท่านั้น สิ่งต่างๆ จะเกิดขึ้นได้ต้องเกิดจากการประสานงาน การทำงานร่วมกันกับหลายๆ ฝ่าย ดังนั้น ทักษะการทำงานเป็นทีม การปรับตัวให้เข้ากับทีม ทักษะเรื่องของการสื่อสารเป็นเรื่องสำคัญมาก',
      ]"
      recommendCourseDescription="จริงๆ แล้วการจะเป็น Game AR/VR Developer นั้นสามารถเลือกเรียนได้หลากหลายสาขาแต่ถ้าจะให้ดี ก็ควรจะต้องเลือกเรียนมาทางสายที่เกี่ยวข้องบ้าง จะได้ไม่ต้องปรับตัวมากนักในตอนทำงานจริง ในระดับมัธยมก็ควรจะเลือกมาทางสายวิทย์-คณิต เพื่อปูทางตนเองไปสู่ระดับมหาวิทยาลัยในคณะที่เกี่ยวข้องด้านคอมพิวเตอร์ การเขียนโปรแกรม ซึ่งก็จะมีคร่าวๆ ดังนี้"
      recommendImg="@/assets/job/game-arvr-developer/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: '',
          details: [
            {
              place: 'คณะศิลปศาสตรบัณฑิต',
              courses: ['สาขาวิชาการออกแบบเชิงโต้ตอบ และการพัฒนาเกม'],
            },
            {
              place: 'คณะเทคโนโลยีสารสนเทศและนวัตกรรม',
              courses: ['หลักสูตรเกมและอินเทอร์แอคทีฟ'],
            },
            {
              place: 'คณะเทคโนโลยีสารสนเทศ',
              courses: ['สาขาวิชาคอมพิวเตอร์เกมมัลติมีเดีย'],
            },
            {
              place: 'คณะอุตสาหกรรมสร้างสรรค์',
              courses: ['สาขาวิศวกรรมคอมพิวเตอร์แอนิเมชันและเกม'],
            },
            {
              place: 'คณะดิจิทัลมีเดีย',
              courses: ['สาขาคอมพิวเตอร์แอนิเมชันและวิชวลเอฟเฟกต์'],
            },
            {
              place: 'คณะเทคโนโลยีสารสนเทศ',
              courses: ['สาขามัลติมีเดียแอนิเมชัน'],
            },
            {
              place: 'คณะวิทยาการสารสนเทศ',
              courses: ['สาขาคอมพิวเตอร์แอนิเมชัน'],
            },
            {
              place: 'คณะวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ ',
              courses: ['สาขามัลติมีเดียแอนิเมชัน'],
            },
            {
              place: 'คณะเทคโนโลยีสารสนเทศ',
              courses: ['สาขาการพัฒนาสื่อประสม และเกม'],
            },
            {
              place: 'คณะมัณฑนศิลป์',
              courses: ['สาขามัลติมีเดียดีไซน์ (Multimedia Design)'],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'
import striptags from 'striptags'

export default Vue.extend({
  name: 'GameARVRDeveloper',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/game-arvr-developer/main.png'),
      title: 'นักพัฒนาเกม AR/VR',
      subTitle: '(Game AR/VR Developer)',
      description: `
        <p>นักพัฒนาเกม AR/VR (Game AR/VR Developer) คือ อาชีพผู้พัฒนาซอฟต์แวร์หรือแอปพลิเคชันเกมให้สามารถใช้งานกับเทคโนโลยี AR (Augmented reality) และ VR (Virtual reality) ได้ เพื่อตอบสนองความต้องการในด้านความบันเทิงที่เหนือระดับ และเพิ่มประสบการณ์พิเศษที่สมจริงให้กับผู้ใช้งาน ซึ่งนักพัฒนาเกม AR/VR จำเป็นที่จะต้องมีทักษะและความรู้ที่มากกว่าเรื่องของการโปรแกรมมิ่งสำหรับการสร้างเกมแบบทั่วๆ ไป โดยสิ่งที่จะมีเพิ่มเข้ามาสำหรับสายงานนี้ก็คือ</p>
        <ul class='pl-4 mt-3 text-left'>
          <li>ความรู้ความเข้าใจในเทคโนโลยี AR/VR ในทุกแง่มุม ทั้งความสามารถ ข้อจำกัด และเทรนด์การเปลี่ยนแปลง</li>
          <li>มีความเข้าใจในเรื่อง User Experience กล่าวคือ ค้นหาวิธีที่ทำให้เกิดความสมจริงในการใช้งาน และมีวิธีที่เพิ่มความสะดวกในการเล่นและการใช้งานได้บ้าง</li>
        </ul>
      `,
    }
  },
  head() {
    const instance: any = this

    return {
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: striptags(instance.description),
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
