<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/7dXW8PEmWxY"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription="กว่าจะมาเป็น Game Designer ที่มีหน้าที่หลักในการดูแลองค์ประกอบต่างๆ ภายในเกม ต้องใช้ทักษะต่างๆ ได้แก่"
      :skills="[
        {
          title: 'คณิตศาสตร์',
          description:
            'คณิตศาสตร์ Game Designer ต้องใช้ทักษะด้านคณิตศาสตร์ เพื่อนำมาคำนวณทั้งในเรื่องของความน่าจะเป็น เช่น เกมแนวต่อสู้ พลังโจมตีแบบนี้ค่าพลังของอีกฝ่ายจะลดเหลืออยู่ที่เท่าไหร่ หรือเกมไพ่ ไพ่หนึ่งสำรับจะต้องมีจำนวนเท่าไหร่ รวมถึงอาศัยความรู้เรื่องสมการ เป็นต้น',
          imgSrc: 'game-designer/คณิตศาสตร์.png',
        },
        {
          title: 'ภาษาต่างประเทศ',
          description:
            'ภาษาต่างประเทศ ถือเป็นทักษะสำคัญสำหรับคนที่ผลิตเกมขายในตลาดต่างประเทศ เพราะเนื่องจากต้องสื่อสารเรื่องราวในเกมให้ออกมาเป็นที่เข้าใจได้ โดยเฉพาะอย่างยิ่งภาษาอังกฤษ ซึ่งเป็นภาษากลาง ที่ใช้สื่อสารกันทั่วโลก หรือ ภาษาญี่ปุ่นและภาษาจีน ก็เป็นกลุ่มประเทศที่เล่นเกมเป็นจำนวนมากและเป็นผู้พัฒนาเกมเองด้วย',
          imgSrc: 'game-designer/ภาษาต่างประเทศ.png',
        },
        {
          title: 'ความรู้รอบตัว',
          description:
            'มีความรู้รอบตัว ต้องใช้ความรู้และประสบการณ์มากเป็นพิเศษ และต้องมีความรู้ที่หลากหลาย เช่น การออกแบบเกมซอมบี้ ซึ่งจะต้องออกแบบให้ดูน่ากลัว ลักษณะซอมบี้ และบรรยากาศในเกมที่สมจริง ต่อมาคือความรู้ทางด้านคอมพิวเตอร์และโทรศัพท์มือถือระดับพื้นฐาน ซึ่งต้องดูว่าสิ่งที่ออกแบบมาเหมาะสมกับการใช้เครื่องมือต่างๆ หรือไม่',
          imgSrc: 'game-designer/ความรู้รอบตัว.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/game-designer/character.png"
      :characterDetails="[
        'เปิดรับสิ่งใหม่ๆ อยู่เสมอ ชอบศึกษาหาความรู้ และสนใจสิ่งใหม่ๆ ที่เกิดขึ้นรอบตัว',
        'มีความเป็นผู้นำ มีความรอบคอบ กล้าพูด กล้านำเสนอความคิดของตัวเองสื่อสารให้ทุกคนเข้าใจถึงแนวทางของเกมที่จะพัฒนาขึ้นมา',
        'สื่อสารได้อย่างชัดเจน เด็ดขาด สื่อสารถึงแนวทางการทำงานในการออกแบบเกมที่ชัดเจน ควบคุมงานได้',
        'มีความเข้าใจผู้อื่น ยอมรับฟังความคิดเห็นของคนอื่น',
        'ชอบลองทำสิ่งใหม่ๆอยากเรียนรู้สิ่งใหม่ๆและทดลองทำ',
      ]"
      roleImg="@/assets/job/game-designer/role.png"
      :roles="[
        {
          title: 'Office hours',
          description: 'ชั่วโมงการทำงานเหมือนกับพนักงานบริษัททั่วไป',
        },
        {
          title: 'งานเอกสาร',
          description:
            'ทำงานเกี่ยวกับเอกสาร การร่างแบบต่างๆ ทั้งแบบเกม ลักษณะเฉพาะ (Feature) ให้ตรงตามที่กำหนด',
        },
        {
          title: 'รวบรวมและส่งต่อข้อมูล',
          description: 'ให้ทีมงานที่มีหน้าที่รับผิดชอบในแต่ละส่วนงาน',
        },
        {
          title: 'พูดคุยกับทีมอื่นๆ',
          description:
            'เพื่ออธิบายคอนเซปต์ของเกมที่ต้องการพัฒนาขึ้นให้ทุกคนมีความเข้าใจที่ตรงกัน',
        },
      ]"
      incomeDescription="รายได้เฉลี่ย 15,000-100,000 บาทขึ้นไปต่อเดือน สำหรับนักศึกษาจบใหม่ประมาณ 15,000-25,000 บาทต่อเดือน และปรับเพิ่มตามประสบการณ์ เนื่องจากอุตสาหกรรมเกมในไทยเป็นสิ่งใหม่และกำลังเติบโต ทำให้มีผู้เชี่ยวชาญยังไม่มาก ดังนั้นหากเป็น Game Designer ที่มีฝีมือ จะเป็นที่ต้องการและมีรายได้ค่อนข้างสูง สำหรับโอกาสความก้าวหน้าขึ้นอยู่กับทักษะฝีมือ ประสบการณ์ และเงื่อนไขของบริษัทในการกำหนดเกณฑ์รายได้"
      :recommendLv="[
        'รู้จักตัวเอง รู้ว่าตัวเองชอบทำอะไร มีความหลงใหลในสิ่งใด พื้นฐานอย่างแรกของ Game Designer คือ มักจะชอบเล่นเกม เพราะอาชีพนี้จะต้องอยู่กับแวดวงของเกม ดังนั้นหากเรามีความสุขกับเรื่องราวที่เกี่ยวกับเกม เป็นคนเอาจริงเอาจัง มีความคิดที่เป็นระบบระเบียบ และมีวุฒิภาวะที่สามารถควบคุมทีมงาน ก็สามารถประกอบอาชีพนี้ได้',
        'ลองทำในสิ่งที่ไม่เคยทำ ฝึกฝนความคิดด้านการออกแบบเกมในรูปแบบของตัวเอง เพราะการที่ได้ลองทำในสิ่งที่ไม่เคยทำมาก่อน จะทำให้เห็นได้อย่างชัดเจนขึ้นว่าตัวเองมีความถนัดและเก่งในด้านใด และมีทักษะอะไรที่ควรศึกษาพัฒนาเพิ่มเติม เช่น วางแผนว่าจะออกแบบเกมแนวต่อสู้ ควรมีตัวละครตัวใดบ้างในเกม หลังจากนั้นจึงวางแผนเรื่องรูปแบบการทำงานของทีมงานต่อไป',
        'รวบรวมผลงาน การสะสมผลงาน (portfolio) ถือเป็นสิ่งสำคัญในการเริ่มต้นสมัครงาน โดยไม่จำกัดรูปแบบของผลงาน โดยอาจจะทำจินตนาการเกมออกมาเป็นรูปร่างที่สามารถอธิบายแนวคิดต่างๆ ได้ หรืออีกทางเลือกหนึ่งคือ การออกแบบบอร์ดเกม (board game) เพราะสามารถนำผลงานเหล่านี้ไปต่อยอดในอาชีพ Game Designer ได้',
        'หมั่นศึกษาหาความรู้เพิ่มเติม ในปัจจุบันมีช่องทางมากมายสำหรับการเรียนรู้เทคนิค แนวทาง และแรงบันดาลใจต่างๆ เพื่อนำมาประยุกต์ใช้งานต่อได้ โดยดูจากสื่อออนไลน์มากมาย หรือการไปร่วมงานแสดงเกมต่างๆ เพื่อเก็บเกี่ยวข้อมูล รวมทั้งยังมีหลากหลายช่องทางในการเรียนรู้ ได้แก่  “Design Doc” และ “GameXplain” ทั้งหมดนี้คือ ก้าวสำคัญสู่การทำงานในวงการเกมของอาชีพ Game Designer นั่นเอง',
      ]"
      recommendCourseDescription="Game Designer เป็นอาชีพที่ต้องอาศัยทักษะทางด้านคณิตศาสตร์ เพื่อเรียนรู้หลักพื้นฐานของคณิตศาสตร์ที่ใช้ในการออกแบบโครงสร้างเกม ต่อมาคือ ทักษะด้านการออกแบบ เรียนรู้วิธีสร้างสรรค์ผลงาน และสุดท้ายทักษะทางด้านโปรแกรมคอมพิวเตอร์และซอฟแวร์"
      recommendImg="@/assets/job/game-designer/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: 'ด้านคณิตศาสตร์',
          details: [
            {
              place: 'คณะวิทยาศาสตร์และเทคโนโลยี',
              courses: [
                'สาขาวิชา/ภาควิชาคณิตศาสตร์และสถิติ',
                'สาขาวิชา/ภาควิชาคณิตศาสตร์ประยุกต์',
              ],
            },
          ],
        },
        {
          header: 'ด้านการออกแบบ',
          details: [
            {
              place: 'คณะศิลปกรรมศาสตร์',
              courses: [
                'สาขาวิชา/ภาควิชานฤมิตศิลป์',
                'สาขาวิชา/ภาควิชานิเทศศิลป์',
                'สาขาวิชา/ภาควิชามัลติมีเดียดีไซน์',
              ],
            },
            {
              place: 'คณะดิจิทัลมีเดีย',
              courses: [],
            },
            {
              place: 'คณะสถาปัตยกรรมศาสตร์',
              courses: [],
            },
            {
              place: 'คณะศิลปกรรมการผลิตสื่อ',
              courses: ['สาขาการผลิตภาพยนตร์และแอนิเมชัน'],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'

export default Vue.extend({
  name: 'GameDesigner',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/game-designer/main.png'),
      title: 'นักออกแบบเกม',
      subTitle: '(Game Designer)',
      description:
        'อาชีพที่เปรียบเสมือนผู้กำกับภาพยนตร์ ซึ่งสำหรับ Game Designer นั้น ถือได้ว่าเป็นคนต้นคิดรูปแบบเกมทั้งหมดว่าเกมที่ต้องการพัฒนาขึ้นมา มีวิธีการเล่น กฎกติกา ความยากง่าย ระยะเวลาที่ใช้ในการเล่นเป็นอย่างไร รวมถึงลักษณะหน้าตาของเกม และตลอดการทำงานจะเป็นผู้ที่มีหน้าที่ควบคุมดูแลภาพรวมของเกมตั้งแต่การออกแบบภาพร่างในขั้นต้น การทำให้เกมมีการเคลื่อนไหวไปจนถึงการเขียนโปรแกรมว่าการพัฒนาเกมออกมาหนึ่งเกมนั้น มีภาพรวมตรงตามที่ต้องการหรือไม่ อาจกล่าวได้ว่าเบื้องหลังความสนุกสนานของเกมแต่ละเกมขึ้นอยู่กับ Game Designer นั่นเอง',
    }
  },
  head() {
    const instance: any = this

    return {
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: instance.description,
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
