<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/xSAtpGK4IAQ"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      :hasJobVariant="true"
      jobVariantImg1=""
      jobVariantTitle1="QA-Developer"
      jobVariantDescription1="QA ที่มีส่วนร่วมกับทีมพัฒนาตั้งแต่ขั้นตอนแรกจนถึงขั้นตอนสุดท้ายที่ซอฟต์แวร์เกมได้ถูกเผยแพร่"
      jobVariantImg2=""
      jobVariantTitle2="QA-Publishing"
      jobVariantDescription2="QA Tester ประเภทที่รับงานทดสอบซอฟต์แวร์เกมจากบริษัทผู้พัฒนา เพื่อมาค้นหาความผิดพลาดต่างๆ ของระบบ เป็นส่วนสำคัญในการป้องกันไม่ให้ซอฟต์แวร์เกมที่ผิดพลาดหลุดออกไปยังผู้ใช้งาน"
      skillMainDescription="Game QA Tester ต้องคำนึงอยู่เสมอว่าคุณภาพของผลิตภัณฑ์ซอฟต์แวร์เกม ประสบการณ์ ความสนุกและความพึงพอใจของผู้เล่นจะมากหรือน้อยนั้นขึ้นอยู่กับสายงานนี้ทั้งหมด ดังนั้น ผู้ที่เป็น Game QA Tester ต้องมีคุณสมบัติและทักษะดังต่อไปนี้"
      :skills="[
        {
          title: 'มี Passion ในการเล่นเกม',
          description:
            'เป็นคนที่มีใจรักและชื่นชอบในการเล่นเกม และเป็นคนที่เล่นเกมหลากหลาย เพราะจะช่วยทำให้เข้าใจมิติของเกมได้อย่างครบถ้วน',
          imgSrc: 'game-qa/ชอบเกม.png',
        },
        {
          title: 'คิดวิเคราะห์ปัญหา',
          description:
            'ต้องมีทักษะในการสังเกต มองเห็นในรายละเอียดเล็กๆ ของปัญหา และสามารถที่จะสรุปปัญหาทั้งหมดและอธิบายแบบองค์รวมได้',
          imgSrc: 'game-qa/คิดวิเคราะห์.png',
        },
        {
          title: 'ทักษะการคาดการณ์และมีความเข้าใจในเรื่อง User Experience',
          description:
            'ต้องเข้าใจในเรื่องของ User Experience โดยสามารถคาดการณ์ได้ว่าประสบการณ์แบบใดที่จะทำให้ผู้ใช้งานพึงพอใจได้มากที่สุด',
          imgSrc: 'game-qa/user exp.png',
        },
        {
          title: 'มีกระบวนการคิดอย่างเป็นขั้นตอน (Design Thinking)',
          description:
            'ต้องมีกระบวนการคิดแบบเป็นลำดับขั้นอะไรควรทำก่อนหลัง และจะต้องใช้ความละเอียดและกระบวนการคิดอย่างเป็นระบบ',
          imgSrc: 'game-qa/design-thinking.png',
        },
        {
          title: 'มีความคิดสร้างสรรค์',
          description:
            'Game QA Tester นอกจากจะต้องทำหน้าที่รายงานข้อผิดพลาดแล้ว ยังต้องนำเสนอทางออกหรือวิธีการแก้ปัญหาที่น่าสนใจเข้าไปด้วย ความคิดสร้างสรรค์และไอเดียใหม่ๆ จึงเป็นเรื่องที่จำเป็น',
          imgSrc: 'game-qa/ความคิดสร้างสรรค์.png',
        },
        {
          title: 'การแก้ปัญหาเฉพาะหน้า',
          description:
            'เนื่องจากเราไม่สามารถคาดการณ์บางปัญหาที่จะเกิดขึ้นด้ แต่เมื่อเกิดแล้วจะต้องหาวิธีที่จะแก้ไข และหากแก้ไขไม่ได้ก็ต้องหาวิธีที่จะสื่อสารออกไปให้ผู้ที่เกี่ยวข้องเข้าใจว่าเป็นปัญหาอย่างไร และทำไมควรจะต้องได้รับการแก้ไข',
          imgSrc: 'game-qa/แก้ปัญหาเฉพาะหน้า.png',
        },
        {
          title: 'ทักษะทางด้านภาษาและการสื่อสาร',
          description:
            'เนื่องจากต้องประสานงานกับทางบริษัทผู้พัฒนาเกมจากต่างประเทศอยู่เสมอ รวมถึงจะต้องมีการแปลภาษาอังกฤษจากเนื้อหาเกม และต้องมีทักษะในการสื่อสารอธิบายความหมายของสิ่งที่ยากและซับซ้อนให้เป็นสิ่งที่เข้าใจได้ง่าย ',
          imgSrc: 'game-qa/สื่อสาร.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/game-qa/character.png"
      :characterDetails="[
        'ช่างสังเกต ช่างสงสัย และชอบตั้งคำถาม',
        'มีความอดทน พร้อมรับแรงกดดันได้ดี',
        'ละเอียดรอบคอบ ใส่ใจในทุกรายละเอียด',
        'ตรงไปตรงมา ยึดหลักความถูกต้องและความเป็นจริง เมื่อเห็นสิ่งที่ไม่ถูกต้อง จะไม่ปล่อยผ่านแม้จะเป็นเรื่องเล็กน้อยก็ตาม',
        'บริหารจัดการเวลา รู้จักลำดับความสำคัญของงานและบริหารเวลาการทำงานให้มีประสิทธิภาพสูงสุด',
      ]"
      roleImg="@/assets/job/game-qa/role.png"
      :roles="[
        {
          title: 'ทดสอบเกม',
          description: 'เพื่อหาข้อผิดพลาดระหว่างการเล่นและวัดระดับความสนุกของเกม',
        },
        {
          title: 'รายงานผลการทดสอบ',
          description: 'จัดทำรายงานไปยังทีมผู้พัฒนาเพื่อแก้ไข ',
        },
      ]"
      :incomeDescription="`
        <p>รายได้ระดับเริ่มต้น 15,000 บาทต่อเดือน และระดับผู้จัดการขึ้นไปเฉลี่ย 40,000 – 50,000 บาท</p>
        <p>อาชีพ Game QA Tester เป็นสายงานที่มีความเกี่ยวพันเชื่อมโยงกับ<span style='white-space: nowrap'>สายงาน</span>อื่นๆ และยังเป็นงานที่มีความสำคัญและเป็นเสมือนบันไดขั้นแรกหรือประตูบานแรกที่จะนำไปสู่สายงานในด้านเทคโนโลยีหรือด้านเกม หรือสามารถที่จะพัฒนาไปสู่การเป็น Game Operation Manager ได้ ดังนั้น เรื่องรายได้จึงขึ้นอยู่กับสายงานที่ทำในอนาคตด้วย</p>
      `"
      :recommendLv="[
        'วางแผนและตั้งเป้าหมาย การเริ่มต้นทำงาน QA เป็นบันไดที่สำคัญไปสู่สายงานอื่นๆ ต่อไป ดังนั้น จึงต้องตั้งเป้าหมายให้ชัดเจนว่าอยากทำงานเพื่อเติบโตไปสู่ตำแหน่งใดและต้องเรียนรู้ด้านใดบ้าง',
        'Passion ความชื่นชอบในลักษณะงาน คือสิ่งที่ต้องมีเพราะเป็นสิ่งที่ช่วยให้ก้าวข้ามอุปสรรคต่างๆ ที่คุณเจอระหว่างทางได้',
        'การสื่อสารที่ถูกต้องและเข้าใจง่าย เนื่องจาก งาน QA ต้องถ่ายทอดและรายงานสิ่งที่ทำการทดสอบไปยังสายงานที่เกี่ยวข้อง อาทิ Game Developer ดังนั้น การสื่อสารที่ชัดเจนและตรงประเด็นจะทำให้สามารถแก้ไขปัญหาที่เกิดขึ้นในเกมนั้นๆ ได้',
      ]"
      recommendCourseDescription="การทำงานในด้าน Game QA Tester เป็นสายงานที่ไม่มีทักษะเฉพาะทางที่เด่นชัด โดยสามารถฝึกฝนเรียนรู้และต่อยอดด้วยตัวเองได้ในภายหลังได้ แต่อย่างน้อยควรมีความรู้หรือทักษะพื้นฐานเกี่ยวกับด้านคอมพิวเตอร์ ดังนั้นในระดับมัธยมจึงควรเลือกเรียนทางสายวิทย์-คณิต เพื่อปูทางตนเองไปสู่ระดับมหาวิทยาลัยในคณะที่เกี่ยวข้องด้านคอมพิวเตอร์ อาทิ"
      recommendImg="@/assets/job/game-qa/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: '',
          details: [
            {
              place: 'คณะวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ',
              courses: ['สาขามัลติมีเดียแอนิเมชัน'],
            },
            {
              place: 'คณะเทคโนโลยีสารสนเทศ',
              courses: ['สาขาวิชาคอมพิวเตอร์เกมมัลติมีเดีย'],
            },
            {
              place: 'คณะอุตสาหกรรมสร้างสรรค์',
              courses: ['สาขาวิศวกรรมคอมพิวเตอร์แอนิเมชันและเกม'],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'

export default Vue.extend({
  name: 'GameQA',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/game-qa/main.png'),
      title: 'นักทดสอบระบบเกม',
      subTitle: '(Game QA Tester)',
      description:
        'คือ งานที่เกี่ยวกับการทดสอบ ตรวจสอบประเมินและปรับปรุงคุณภาพเกม จากนั้นต้องรายงานปัญหาของเกมที่พบเจอ เพื่อให้ทีมที่พัฒนาเกมหาแนวทางแก้ไขและอุดช่องโหว่ของปัญหาที่เกิดขึ้นหรือมีแนวโน้มที่จะเกิดขึ้น และเมื่อเกมได้เปิดให้บริการสู่สาธารณะแล้ว Game QA Tester ต้องรับ Feedback จากผู้ใช้งานและทำรายงานกลับไปให้แก่ทางทีมผู้พัฒนาได้แก้ไข เพื่อให้ปัญหาส่งผลกระทบน้อยที่สุดหรือสั้นที่สุดสำหรับผู้ใช้งานนั่นเอง แบ่งออกเป็น 2 ประเภท ได้แก่',
    }
  },
  head() {
    const instance: any = this

    return {
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: instance.description,
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
