<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/bOjPqETCxKw"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription="Sound Designer เป็นสายงานที่ต้องทำงานด้านเสียง แต่ไม่ใช่แค่การตัดต่อหรือบันทึกเสียง ยังต้องมีการสร้างและออกแบบเสียงใหม่ ๆ ด้วย ทำให้ต้องมีความคิดสร้างสรรค์ มีทักษะและความรู้เชิงลึกในหลายด้าน โดยคุณสมบัติและทักษะที่ Sound Designer ควรจะต้องมีหลัก ๆ ดังนี้"
      :skills="[
        {
          title: 'ทักษะเรื่องมิติของเสียง',
          description:
            'ต้องมีความรู้ความเข้าใจในเรื่องมิติของเสียงที่ค่อนข้างลึกซึ้ง ซึ่งทักษะตรงนี้จะเกิดขึ้นได้ก็โดยฝึกฝน สังเกต การศึกษา และสัมผัสด้วยตัวเอง จดจำประสบการณ์การรับฟังเสียงต่าง ๆ และลองสร้างเสียงเอง ยิ่งได้มีการฝึกฝนบ่อย ๆ ก็จะยิ่งเกิดทักษะในด้านนี้',
          imgSrc: 'sound-designer/ใช้เครื่องมือและอุปกรณ์.png',
        },
        {
          title: 'ทักษะการบันทึกเสียง',
          description:
            'ต้องมีทักษะและความรู้เกี่ยวกับเรื่องการบันทึกเสียง เช่น ทักษะการใช้อุปกรณ์บันทึกเสียง อย่างไมโครโฟน เทคนิคในการบันทึกเสียงในลักษณะต่าง ๆ',
          imgSrc: 'sound-designer/ใช้เครื่องมือและอุปกรณ์.png',
        },
        {
          title: 'ทักษะในการซอฟต์แวร์โปรแกรม Sound Engine',
          description:
            'ซอฟต์แวร์โปรแกรมที่จำเป็นสำหรับสายงานนี้เลยก็มีหลายโปรแกรม โดยหลัก ๆ แล้วก็จะมี Cubase ที่ใช้สำหรับสร้างเสียง ตัดต่อและมิกซ์เสียง รวมไปถึงโปรแกรมประเภท Audio Middleware ที่เป็นเครื่องมือสำหรับสร้างและพัฒนาเอฟเฟกต์เสียงต่าง ๆ ในเกมได้หลายแพลตฟอร์ม เช่น โปรแกรม FMOD, Wwise (Wave Work Interactive Sound Engine) เป็นต้น',
          imgSrc: 'sound-designer/เขียนโปรแกรม.png',
        },
        {
          title: 'ทักษะเรื่องของดนตรีและการประพันธ์ดนตรี',
          description:
            'การประพันธ์ดนตรีสำหรับเกมไม่ได้เป็นหน้าที่หลักหรือความรับผิดชอบหลักของ Sound Designer แต่ในการทำงานจริง ๆ ในบางองค์กรอาจไม่ได้มีผู้รับผิดชอบ Music Composer โดยตรง ทำให้ Sound Designer อาจต้องรับผิดชอบดูแลในส่วนนี้ด้วย หากมีความรู้เรื่องของดนตรี การประพันธ์ดนตรี หรือการใช้เครื่องมือสำหรับการช่วยประพันธ์ดนตรีบ้างก็จะช่วยให้การทำงานราบรื่นมากขึ้น​',
          imgSrc: 'sound-designer/ใช้เครื่องมือและอุปกรณ์.png',
        },
        {
          title: 'ทักษะด้านภาษาอังกฤษ',
          description:
            'ทักษะด้านภาษาอังกฤษก็มีความจำเป็นมาก หากมีทักษะทางด้านภาษาอังกฤษด้วย การศึกษาเรียนรู้เทคนิควิธีการใหม่ ๆ รวมถึงการใช้เครื่องมือใหม่ ๆ ก็จะเป็นเรื่องที่ง่ายมากขึ้น',
          imgSrc: 'sound-designer/ภาษาต่างประเทศ.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/sound-designer/character.png"
      :characterDetails="[
        'มี Passion ในการเล่นเกม',
        'สนใจและชอบสังเกตในเรื่องเสียง',
        'มีความเป็นนักทดลอง รู้สึกสนุกกับการได้ทดลองสร้างเสียงแปลก ๆ ใหม่ ๆ',
        'เป็นคนที่มีจินตนาการและความคิดสร้างสรรค์',
        'เป็นคนที่มีความอดทนสูง และพร้อมที่จะเรียนรู้อยู่เสมอ',
      ]"
      roleImg="@/assets/job/sound-designer/role.png"
      :roles="[
        {
          title: 'Creative Sound Designer',
          description:
            'ทำหน้าที่ออกแบบและผลิตเสียง เป็นการสร้างสรรค์เสียงใหม่ ๆ ขึ้นมาจากสิ่งของ เครื่องมือ สภาพแวดล้อม และทุกสิ่งที่อยู่รอบตัว โดยไม่จำเป็นต้องยุ่งเกี่ยวกับเทคนิคการใช้โปรแกรมเสียงต่าง ๆ',
        },
        {
          title: 'Technical Sound Designer',
          description:
            'ตำแหน่งนี้อาจเรียกในอีกชื่อหนึ่งได้ว่า “Sound Programmer” จะทำหน้าที่ในการใช้เครื่องมือเชิงเทคนิค อาจเป็นการเขียนโค้ดหรือใช้โปรแกรมเฉพาะด้านเสียง ทำการสร้างและใส่องค์ประกอบเสียงเข้าไปในตัวเกม โดยอาจนำเสียงที่ได้จากฝ่าย Creative Sound Designer มาใส่เข้าไปในเกม หรือสร้างองค์ประกอบเสียงขึ้นใหม่จากโปรแกรมแล้วใส่เข้าไปในเกมก็ได้เช่นกัน',
        },
        {
          title: 'Voice Over Editor',
          description:
            'ทำหน้าที่นำสคริปต์ (Script) เสียงพูด เสียงบรรยายของตัวละครต่าง ๆ ในเกมมาตัดต่อให้เกิดความเหมาะสม และนำเสียงที่ตัดต่อแล้วเหล่านี้ใส่เข้าไปในเกม',
        },
        {
          title: 'Music Composer',
          description: ' ทำหน้าที่เขียนสกอร์ประพันธ์เพลงและดนตรีประกอบเกม เป็นต้น',
        },
      ]"
      incomeDescription="รายได้โดยเฉลี่ย 30,000 - 100,000 บาท/เดือน ซึ่งถ้าประสบการณ์สูงรายได้ก็อาจจะขยับขึ้นไปอยู่ที่ประมาณ 180,000 - 200,000 บาท/เดือน สวัสดิการก็จะได้รับตามมาตรฐานการทำงานทั่วไป ส่วนฟรีแลนซ์รายได้ก็ขึ้นอยู่กับแต่ละโปรเจกต์ แต่ก็โดยมากมาตรฐานก็จะอยู่ที่โปรเจกต์ละ 30,000 บาทขึ้นไป และไม่มีสวัสดิการ"
      :recommendLv="[
        `หมั่นหาความรู้ อ่านหนังสือหรือดูภาพยนตร์ให้มาก ๆ เพื่อให้เราได้มีจินตนาการ เทคนิคในการเล่าเรื่องที่ดี เพราะหากเรามีการคิดเชื่อมโยงเรื่องราวได้ดี จะทำให้เรารู้วิธีที่จะใช้เสียงต่าง ๆ ในการเชื่อมโยงภาพต่าง ๆ ให้เป็นเรื่องราวเดียวกัน ตรงนี้จะช่วยให้เราพัฒนาสามารถนำไปใช้ในการออกแบบเสียงสำหรับเกมแต่ละเกมที่มีเนื้อหาต่างกันได้`,
        'เรียนรู้เครื่องมือ ศึกษาการใช้งานซอฟต์แวร์และหมั่นฝึกฝนให้สามารถใช้งานได้อย่างคล่องตัว ควรจะต้องเรียนรู้วิธีการใช้งานซอฟต์แวร์ในการสร้างเสียงต่าง ๆ และฝึกการใช้งานให้เกิดความชำนาญ อันจะช่วยให้ทำงานได้รวดเร็วขึ้น รวมไปถึงต้องเรียนรู้เทคโนโลยีหรือเครื่องมือใหม่ ๆ ที่เข้ามาด้วย',
        'สร้างมาตรฐานการทำงานของตนเอง กำหนดมาตรฐานคุณภาพงานของตัวเองให้สูงไว้ ไม่ว่างานที่ได้รับจะยากหรือง่ายอย่างไรก็ต้องทำออกมาให้ตรงตามมาตรฐานที่วางไว้เสมอ ตรงนี้ถือเป็นเคล็ดลับที่จะทำให้เราประสบความสำเร็จในอาชีพ',
        'ท้อได้แต่อย่างถอย เมื่อเจออุปสรรคพยายามสร้างกำลังใจให้ตนเอง แล้วจะทำให้เราก้าวข้ามทุกอุปสรรคทุกอย่างไปได้',
      ]"
      recommendCourseDescription="ปัจจุบันสถาบันการศึกษาต่าง ๆ เริ่มมีหลักสูตรการเรียนการสอนที่จะนำไปสู่สายงาน Sound Designer แล้ว โดยส่วนใหญ่จะเป็นองค์ความรู้แบบกว้าง ๆ ไม่ได้เจาะจงเฉพาะกับการออกแบบเสียงในเกมโดยตรง รวมไปถึงบางแห่งยังมีการเปิดคอร์สเรียนระยะสั้นเพื่อให้ความรู้ในเชิงเทคนิคการใช้เครื่องมือและซอฟต์แวร์ด้านเสียงโดยตรงด้วย แต่ความรู้เหล่านี้อาจไม่ได้เฉพาะเจาะจงไปในเรื่องของการสร้างเสียงในเกมเพียงอย่างเดียว มักจะเป็นความรู้กว้าง ๆ แต่ก็สามารถที่จะนำมาประยุกต์ใช้ในการปฏิบัติงานสร้างเสียงในเกมได้จริง โดยหลักสูตรที่แนะนำมีดังนี้"
      recommendImg="@/assets/job/sound-designer/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: 'หลักสูตรเทคโนโลยีมัลติมีเดีย สาขาวิทยาการคอมพิวเตอร์',
          details: [],
        },
        {
          header: 'หลักสูตรดุริยางคศาสตรบัณฑิต สาขาเทคโนโลยีวิศวกรรมดนตรี',
          details: [],
        },
        {
          header:
            'หลักสูตรดุริยางคศาสตรบัณฑิต สาขาการออกแบบเสียงและการประพันธ์เพลงประกอบสื่อ',
          details: [],
        },
        {
          header: 'คอร์สเรียนออนไลน์หลักสูตรการออกแบบระบบเสียง',
          details: [],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'

export default Vue.extend({
  name: 'GameDeveloper',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/sound-designer/main.png'),
      title: 'นักออกแบบเสียง',
      subTitle: '(Sound Designer (Game))',
      description:
        'Sound Designer (Games) เป็นสายงานที่เกี่ยวกับการออกแบบเสียงต่าง ๆ ภายในเกม อย่างเสียง Sound Effect ต่าง ๆ เสียงบรรยากาศภายในเกม โดย Sound Designer ทำการออกแบบและสร้างเสียงขึ้นมาเพื่อให้ตรงกับคอนเซ็ปต์เนื้อเรื่องของเกม หรือไม่ก็จะให้ออกแบบเสียงขึ้นมาใหม่ให้เกิดความเหมาะสมสอดคล้องไปกับเนื้อเรื่องของเกม ซึ่งการเล่าเรื่องด้วยเสียงนี้จะเป็นการช่วยเสริมการเล่าเรื่องด้วยภาพอีกชั้นหนึ่ง เป็นการนำเสนอเรื่องราวและอารมณ์ของเกมผ่านมิติของเสียง เพื่อเติมเต็มอรรถรสของเกมให้มีความสนุกที่ครบทุกมิติทั้งภาพและเสียง สามารถดึงดูดหรือทำให้ผู้เล่นเกิดความรู้สึกว่าเหมือนก้าวเข้าไปสู่ตัวเกมนั้นได้จริง ๆ ทำให้เกมมีความสมบูรณ์ สมจริง หรือเหนือจริงตามที่ต้องการ เป็นการสร้างมิติด้านเสียงเพื่อให้เกมสามารถตอบสนองอารมณ์ความรู้สึกของผู้เล่นได้อย่างลึกซึ้งนั่นเอง',
    }
  },
  head() {
    const instance: any = this

    return {
      title: 'อาชีพ Sound Designer (Game)',
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: instance.description,
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
