<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/bsBqnXTtJ8s"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription=""
      :skills="[
        {
          title: 'ทักษะด้านศิลปะ',
          description:
            'เป็นทักษะที่เกี่ยวกับการทำภาพกราฟิก ทั้งการทำภาพ 2D และ 3D เนื่องจากผลงานที่จะนำเสนอออกไปจะให้ความรู้สึกในเชิงศิลปะ เช่น ทำเอฟเฟกต์ที่อยู่ในเกมที่จะต้องดูสวยงามเพื่อให้ผู้เล่นผู้ใช้งานเกิดความรู้สึกร่วมไปกับเกม และต้องสื่อสารกับผู้เชี่ยวชาญในด้านนี้โดยตรง จึงควรมีทักษะในด้านนี้เพื่อที่จะได้เข้าใจมุมมองของผู้ที่ทำงานในด้านนี้ด้วยนั่นเอง',
          imgSrc: 'technical-artist/ความรู้ด้านศิลปะ.png',
        },
        {
          title: 'ทักษะการเขียนโปรแกรม',
          description:
            'ระบบต่าง ๆ ภายในเกมจะดำเนินไปได้นั้น จะต้องมีการป้อนชุดคำสั่งลงไป จึงต้องอาศัยการเขียนโปรแกรม เสมือนการใส่มันสมองเข้าไปให้กับงานศิลปะต่าง ๆ ที่สร้างขึ้นมา ให้งานเหล่านั้นมีมิติ มีชีวิต เคลื่อนไหว แสดงภาพหรือตอบโต้ตามที่เราต้องการ ทำให้ต้องมีความเข้าใจเพียงพอที่จะสื่อสารกับทีมงานที่เป็น Professional ในด้านนี้ได้',
          imgSrc: 'technical-artist/เขียนโปรแกรม.png',
        },
        {
          title: 'ทักษะการทำงานแอนิเมชัน',
          description:
            'หลังจากการสร้างวัตถุและสิ่งต่าง ๆ ขึ้นมาในเกมแล้ว จะมีการปรับแต่งให้ตัวละครที่สร้างขึ้นนั้นมีความสวยงาม โดยความรู้ที่จำเป็นมากก็คือการทำ “Rigging” เป็นการใส่กระดูกให้ตัวละคร เป็นเทคนิคควบคุมการเคลื่อนไหวของตัวละครในบริบทของสภาพแวดล้อมต่าง ๆ ที่ช่วยทำให้ตัวละครที่สร้างขึ้นดูเหมือนมีชีวิต สามารถเคลื่อนไหวได้ลื่นไหลสมจริง',
          imgSrc: 'technical-artist/รู้เรื่องแอนิเมชัน.png',
        },
        {
          title: 'ทักษะทางด้านคณิตศาสตร์และการคำนวณ',
          description:
            'การสร้างวัตถุในเกม จะต้องมีการคำนวณอัตราส่วนต่าง ๆ จึงต้องอาศัยความเข้าใจในเรื่องพีชคณิต คณิตศาสตร์เมทริกซ์ (Matrix) เวกเตอร์ การเทียบอัตราส่วน ฟิสิกส์ที่เกี่ยวกับกฎของการเคลื่อนที่ เป็นต้น เพราะจะช่วยทำให้งานออกมาดูมีความสมจริงและมีความสมบูรณ์แบบมากขึ้น',
          imgSrc: 'technical-artist/คณิตศาสตร์.png',
        },
        {
          title: 'ทักษะด้านการสื่อสารและภาษาอังกฤษ',
          description:
            'Technical Artist ต้องทำหน้าที่เชื่อมประสานแนวคิดจากทีม Artist กับทีม Programmer ให้ทั้งสองฝั่งมีความเข้าใจที่ตรงกัน ทำให้ต้องมีทักษะในการสื่อสารการอธิบายความ รวมถึงต้องมีทักษะด้านภาษาอังกฤษที่มีความจำเป็นมาก เพราะข้อมูลที่จำเป็นต้องใช้ในงานจะเป็นภาษาอังกฤษทั้งหมด',
          imgSrc: 'technical-artist/ภาษาต่างประเทศ.png',
        },
        {
          title: 'ทักษะด้านการใช้ซอฟต์แวร์ออกแบบและสร้างเกม',
          description:
            'ซอฟต์แวร์สำหรับการออกแบบและสร้างเกม หรือ Game Engine นั้น เสมือนเป็นเครื่องมือหลักอีกประการในการสร้างสรรค์และพัฒนาเกม จึงเป็นทักษะอีกด้านที่ Technical Artist จำเป็นจะต้องมีความรู้และใช้งานได้อย่างคล่องแคล่ว',
          imgSrc: 'technical-artist/โปรแกรมแอนิเมชัน.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/technical-artist/character.png"
      :characterDetails="[
        'มี Passion ในการเล่นเกม แล้วสังเกตสิ่งที่เกิดขึ้นภายในเกมและเริ่มตั้งคำถามว่าเกิดขึ้นได้อย่างไร กระบวนการที่ทำให้เกิดสิ่งนั้นคืออะไร จากนั้นก็จะลงมือศึกษาและทดลองทำ',
        'สนใจในเรื่องของศิลปะและงานแอนิเมชัน',
        'มีความคิดเชิงตรรกะ (Logical Thinking) คิดวิเคราะห์อย่างเป็นเหตุผล และสามารถจัดลำดับกระบวนการคิดและทำอย่างเป็นขั้นเป็นตอนได้',
        'มีมนุษยสัมพันธ์ดี เข้ากับผู้คนได้ง่าย',
        'ใฝ่รู้ใฝ่เรียน ชอบเรียนรู้สิ่งใหม่ ๆ',
      ]"
      roleImg="@/assets/job/technical-artist/role.png"
      :roles="[
        {
          title: 'อำนวยการและประสานงาน',
          description:
            'เป็นสื่อกลางระหว่างทีม Artist กับ Programmer เพื่อให้เข้าใจที่ตรงกัน',
        },
        {
          title: 'สร้างเครื่องมือ',
          description:
            'สร้างเครื่องมือ ให้ทีม Artist และ Programmer สามารถทำงานร่วมกันได้',
        },
        {
          title: 'สร้างจุดเด่นให้ผลิตภัณฑ์เกม',
          description:
            'ใช้เทคนิคการทำ Special Effect เพื่อให้เกมสามารถสื่อสารและตอบสนองกับผู้เล่นได้ดีขึ้น',
        },
        {
          title: 'เพิ่มประสิทธิภาพให้กับเกม',
          description:
            'ค้นหาวิธีการที่จะทำให้เกมรันได้โดยไม่ใช้ทรัพยากรฮาร์ดแวร์มากเกินไป',
        },
      ]"
      incomeDescription="รายได้โดยเฉลี่ย 600 - 1,000 บาท/ชั่วโมง และรายได้มีโอกาสที่จะสูงขึ้นไปเรื่อย ๆ ตามประสบการณ์ ส่วนสวัสดิการก็จะได้รับตามมาตรฐานการทำงานทั่วไป <br/><br/> เนื่องจากบุคลากรในสายงานนี้ยังมีจำนวนน้อย และหน้าที่ความรับผิดชอบค่อนข้างมากจึงจัดว่าเป็นหนึ่งสายงานที่มีรายได้สูงเลยทีเดียว"
      :recommendLv="[
        `เรียนรู้และค้นหาเทคนิคในการสร้างเกม (สามารถเปิดโลกทัศน์การเรียนรู้ได้จาก YouTube)`,
        'ทำความเข้าใจเทคนิคอันหลากหลายเหล่านั้น สรุปเป็นความเข้าใจของตนเอง',
        'ลงมือทำ ลองผิดลองถูก อย่ากลัวที่จะผิดพลาดและอย่าท้อเมื่อไม่สำเร็จ',
        'หากเจองานที่ยาก มีอุปสรรคและมีแรงกดดัน จงอย่าเดินหนี และควรที่จะนำตนเองลงไปอยู่ตรงจุดนั้น เพื่อประเมินตนเองว่ามีความสามารถที่จะรับมือกับปัญหาเหล่านั้นได้หรือไม่ หากสามารถรับมือได้ ก็เท่ากับว่าเรามีความพร้อมที่จะก้าวไปสู่สายงาน Technical Artist ในอนาคตได้',
      ]"
      recommendCourseDescription="ปัจจุบันยังไม่มีหลักสูตรการเรียนการสอนที่จะนำไปสู่สายงาน Technical Artist โดยตรง แต่ด้วยสายงานนี้ผู้ที่ปฏิบัติงานจำเป็นจะต้องมีความรู้ในหลากหลายด้าน โดยนำองค์ความรู้หลาย ๆ ศาสตร์มาประยุกต์ใช้ในการปฏิบัติงานจริง ทำให้สามารถเลือกเรียนได้หลากหลายสาขา ยกตัวอย่างเช่น"
      recommendImg="@/assets/job/technical-artist/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: 'เทคโนโลยีมัลติมีเดียและการสร้างภาพเคลื่อนไหว',
          details: [],
        },
        {
          header: 'เทคโนโลยีสารสนเทศและการสื่อสาร',
          details: [],
        },
        {
          header: 'เกมและสื่ออินเทอร์แอคทีฟ',
          details: [],
        },
        {
          header: 'วิทยาการคอมพิวเตอร์',
          details: [],
        },
        {
          header: 'Computer Animation and Visual Effects เป็นต้น',
          details: [],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'

export default Vue.extend({
  name: 'GameDeveloper',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/technical-artist/main.png'),
      title: 'Technical Artist',
      subTitle: '(Technical Artist)',
      description:
        'Technical Artist หรือ Visual Effects (VFX) Artist เป็นสายงานที่อยู่กึ่งกลางระหว่างงานสาย Artist กับงานสาย Programmer ผู้ที่จะเข้ามาทำงานในสายงานนี้จะต้องมีความรู้แบบไฮบริด คือ จะต้องมีพื้นฐานความรู้ทักษะทั้งทางด้านศิลปะและการเขียนโปรแกรม',
    }
  },
  head() {
    const instance: any = this

    return {
      title: 'Technical Artist',
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: instance.description,
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
