<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/wwTqqTGbT5g"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription="ก่อนที่จะก้าวเข้าสู่การเป็น eSports Player ควรต้องทำความเข้าใจเสียก่อนว่า eSports Player มีความแตกต่างอย่างมากกับผู้ที่เล่นเกมออนไลน์จนเก่ง เนื่องจาก eSports Player ไม่ได้ทำเพียงแค่เล่นเกมออนไลน์ให้เก่งมากๆ เพียงเท่านั้น แต่ยังต้องทุ่มเทฝึกซ้อมอย่างหนักจนมีทักษะต่างๆ ที่จะเป็นตัวกำหนดความสำเร็จให้ไปสู่เป้าหมายที่คาดหวังได้ ซึ่งต่างจากการเล่นเกมออนไลน์โดยทั่วไป สำหรับทักษะที่สำคัญ ได้แก่"
      :skills="[
        {
          title: 'มีความสามารถในการแข่งขันเกมออนไลน์',
          description:
            'eSports Player จะต้องมีความสามารถในการแข่งขันเกมออนไลน์ในระดับสูง โดยตั้งใจฝึกซ้อมเกมออนไลน์ประเภทที่ตัวเองถนัดอย่างหนัก และเลือกตำแหน่งผู้เล่นในเกมที่เหมาะสมกับสไตล์การเล่นของตัวเองมากที่สุด เช่น เกม RoV (Arena of Valor) จะมีตำแหน่งผู้เล่นทั้งหมด 5 ตำแหน่ง คือ Midlane Support Jungle Offlane และ ADlane ซึ่งควรมุ่งพัฒนาการเล่นในตำแหน่งนั้นๆ ให้เกิดความเชี่ยวชาญมากที่สุด',
          imgSrc: 'esport-player/แข่งเกมออนไลน์.png',
        },
        {
          title: 'ทักษะในการคิดวิเคราะห์',
          description:
            'เป็นอีกหนึ่งทักษะที่จำเป็นเพราะในระหว่างการแข่งขันจะต้องใช้ทักษะในการคิดวิเคราะห์แนว ทางการเล่นเกมของคู่แข่งให้ได้ เพื่อสามารถตอบโต้และปรับเปลี่ยนกลยุทธ์การแข่งขันในระหว่างแข่งขันได้ตลอดเวลา นอกจากนี้ ต้องมีการทำงานเป็นทีมซึ่งการวิเคราะห์ลักษณะการเล่นของผู้เล่นในทีมเดียวกันก็จะทำให้เล่นเข้าขากันมากขึ้น อีกทั้งตำแหน่งต่างๆ ในแต่ละเกมมีหน้าที่แตกต่างกันออกไป ดังนั้นขณะที่แข่งขันจึงต้องพูดคุยปรึกษากันภายในทีม เพื่อวิเคราะห์หาแนวทางในการแก้เกมและเอาชนะคู่ต่อสู้ให้ได้ในที่สุด',
          imgSrc: 'esport-player/คิดวิเคราะห์.png',
        },
        {
          title: 'มีไหวพริบ',
          description:
            'นอกจากสามารถคิดวิเคราะห์ได้เฉียบคม ทักษะเสริมที่ต้องมีก็คือ การมีไหวพริบ ความรวดเร็วในการรับรู้สิ่งที่กำลังเกิดขึ้น และสามารถแก้ปัญหา หรือแก้เกมให้กลับมาเป็นผู้นำได้อย่างไร นอกจากนี้ตลอดเวลาที่แข่งขันยังต้องมีวิจารณญาณในการตัดสินใจทำสิ่งต่างๆ ได้อย่างรวดเร็ว เช่น การออกอาวุธ การหลบคู่ต่อสู้ เป็นต้น เพราะการแข่งขันแต่ละเกมใช้ระยะเวลาค่อนข้างสั้น และการเดินเกมระหว่างคู่ต่อสู้เกิดขึ้นอย่างรวดเร็ว ถ้าตัดสินใจช้าไปแค่เสี้ยววินาทีก็อาจทำให้เสียเปรียบฝ่ายตรงข้ามหรือแพ้ไปเลยก็ได้',
          imgSrc: 'esport-player/มีไหวพริบ.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/esport-player/character.png"
      :characterDetails="[
        'ขยันและตั้งใจ ตั้งใจฝึกซ้อมอย่างสม่ำเสมอ เพื่อเพิ่มพูนทักษะและความเชี่ยวชาญในเกม',
        'มีระเบียบวินัย เมื่อกำหนดเป้าหมายแล้ว ระเบียบวินัยในการฝึกซ้อมจะเป็นสิ่งที่นำพาไปสู่ความสำเร็จ',
        'ทำงานเป็นทีมได้ ส่วนใหญ่การแข่งขันจะเป็นในรูปแบบทีม จึงต้องสามารถทำงานร่วมกับทีมได้',
        'มีความอดทน ควบคุมอารมณ์ได้ดี เนื่องจากการแข่งขันมีความกดดันสูง',
        'ใฝ่หาความรู้ ศึกษาหาความรู้ใหม่ๆ อยู่เสมอ',
      ]"
      roleImg="@/assets/job/esport-player/role.png"
      :roles="[
        {
          title: 'ฝึกซ้อมทีม',
          description: 'นัดกับทีมอื่นๆ นอกสังกัดมาร่วมฝึกซ้อมด้วยกัน เพื่อพัฒนาฝีมือ',
        },
        {
          title: 'ฝึกซ้อมตัวฮีโร่',
          description: 'เป็นการฝึกซ้อมเดี่ยวของแต่ละคน',
        },
        {
          title: 'ศึกษาข้อมูลเกม',
          description: '',
        },
      ]"
      :incomeDescription="`
      รายได้เฉลี่ยอยู่ที่ 15,000 ไปจนถึงหลักล้านบาทต่อเดือน ทั้งนี้รายได้ของนักกีฬาแต่ละคนขึ้นอยู่กับองค์ประกอบหลายประการ ดังนี้
      <ol class='pl-4 mt-3 text-left' style='list-style-type:decimal'>
        <li>รายได้จากต้นสังกัด เป็นรายได้ประจำทุกเดือน ขึ้นอยู่กับของสโมสร ความสามารถและประสบการณ์ของนักกีฬา รายได้เริ่มต้นอยู่ที่ 15,000 บาทต่อเดือน</li>
        <li>รายได้จากรางวัลการแข่งขัน เงินรางวัลที่ได้รับจากการแข่งขัน จะมีการทำข้อตกลงกันระหว่างสโมสร และนักกีฬาถึงส่วนแบ่ง นอกจากนี้ ความนิยมของเกมที่ใช้แข่งขันและระดับชั้นในการแข่งขันก็มีอัตราเงินรางวัลที่แตกต่างกัน</li>
        <li>รายได้จากการถ่ายทอดสด (live streaming) เป็นรายได้เพิ่มเติมจากการเล่นเกมถ่ายทอดสดบนช่องทางออนไลน์ต่างๆ เช่น Facebook YouTube หรือ Twitch</li>
        <li>รายได้จากสปอนเซอร์สินค้าต่างๆ eSports Player ที่มีชื่อเสียงจะถูกว่าจ้างจากสินค้าต่าง ๆ ให้เป็นพรีเซ็นเตอร์ สินค้า ออกงาน event หรือการเข้ามาเป็นสปอนเซอร์ให้ทีม ด้วยการให้สวมใส่เสื้อผ้าที่มีโลโก้ของสินค้า ซึ่งรายได้ส่วนนี้จะมีการแบ่งกันในทีมและในสโมสรตามที่ตกลงกัน</li>
      </ol>
      `"
      :recommendLv="[
        'รู้จักตัวเอง ค้นหาตัวเองว่ามีความชอบในอาชีพนี้จริงๆ เนื่องจากเป็นอาชีพที่มีเบื้องหน้าสวยงาม เป็นบุคคลที่มีชื่อเสียง มีรายได้ดี แต่ก็ต้องแลกมาด้วยการฝึกซ้อมอย่างหนัก ความกดดันในการแข่งขัน และควรจะค้นหาให้พบว่า ตัวเองชอบแข่งขันเกมออนไลน์ประเภทใด มีความถนัดในการเล่นตำแหน่งอะไร เพื่อเริ่มต้นฝึกซ้อม',
        'มีระเบียบวินัย ต้องมีระเบียบวินัยในการฝึกซ้อม และแบ่งเวลาอย่างเหมาะสม โดยเฉพาะหากเป็นนักเรียน นักศึกษา',
        `เรียนรู้จากนักกีฬาอาชีพ หากอยากพัฒนาเทคนิคการเล่น สามารถศึกษาได้จากการดูรายการแข่งขันกีฬา<span style='white-space: nowrap'>อีสปอร์ต</span>ต่างๆ ที่สำคัญคือ การศึกษาตำแหน่งผู้เล่นที่ชื่นชอบและอยากจะแข่งขันในตำแหน่งนั้น เพื่อสังเกตและวิเคราะห์วิธีการเล่นของมืออาชีพ ซึ่งสิ่งเหล่านี้จะเป็นส่วนช่วยในการเรียนรู้และพัฒนาฝีมือต่อไป`,
      ]"
      recommendCourseDescription="สำหรับอาชีพ eSports Player ก็เหมือนกับอาชีพอื่นๆ ที่อาจจะไม่จำเป็นต้องเรียนในสาขาวิชานั้นๆ โดยเฉพาะ หากแต่มีใจรักและฝึกฝนพัฒนาตัวเองก็สามารถที่จะประกอบอาชีพนี้ได้ แต่เพื่อความได้เปรียบในอาชีพควรจะมีพื้นฐานความรู้ด้านเกมออนไลน์ในแง่ของโปรแกรม ระบบต่างๆ และองค์ประกอบของเกม เพื่อให้รู้กฎเกณฑ์อย่างลึกซึ้งและเป็นพื้นฐานนำมาต่อยอดกับอาชีพนี้"
      recommendImg="@/assets/job/esport-player/recommend-course.png"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'

export default Vue.extend({
  name: 'EsportPlayer',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/esport-player/main.png'),
      title: 'นักกีฬาอีสปอร์ต',
      subTitle: '(eSports Player)',
      description:
        'มีหน้าที่หลักคือ เป็นนักกีฬาแข่งขันกีฬาอีสปอร์ตและการฝึกซ้อมเพื่อพัฒนาฝีมือการเล่น โดยการแข่งขันเป็นตัวกำหนดผลงานและความสำเร็จของอาชีพนี้ การแข่งขันกีฬาอีสปอร์ตคือ การแข่งขันกีฬาแบบอิเล็กทรอนิกส์ที่มีกฏกติกาสากลเช่นเดียวกับกีฬาทั่วๆ ไป และสโมสรเจ้าของทีมจะมีการเซ็นสัญญาจ้างกับนักกีฬาด้วย ส่วนข้อแตกต่างสำคัญของกีฬาอีสปอร์ตกับกีฬาอื่นๆ คือ ลักษณะการแข่งขันที่มีองค์ประกอบดังนี้ มีเกมออนไลน์เป็นเหมือนสนามแข่งขัน อุปกรณ์ในการแข่งขันคือ เครื่องคอมพิวเตอร์หรือโทรศัพท์มือถือ หูฟัง คียบอร์ด และระบบอินเทอร์เน็ตที่มีประสิทธิภาพสูง โดยระหว่างการแข่งขันนักกีฬาภายในทีมและคู่แข่งอาจจะไม่จำเป็นต้องอยู่ในสถานที่เดียวกัน แต่แข่งขันร่วมกันได้แบบออนไลน์',
    }
  },
  head() {
    const instance: any = this

    return {
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: instance.description,
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
