<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/DCdVFo_Vrig"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription="อาชีพ Gamecaster เป็นอาชีพที่ต้องอยู่หน้ากล้อง เพื่อนำเสนอเรื่องราวต่างๆ ผ่านการเล่นเกมและการพูดให้น่าสนใจและชวนให้ติดตามรับชม โดยต้องอาศัยความมีเอกลักษณ์และบุคลิกภาพที่โดดเด่นเฉพาะตัว รวมทั้งความเข้าใจในการนำเสนอเรื่องราวออกมาในรูปแบบของวิดีโอ จึงมีความจำเป็นที่จะต้องมีทักษะสำคัญ ดังนี้"
      :skills="[
        {
          title: 'ทักษะในการพูดและสื่อสารให้เข้าใจ',
          description:
            'การใช้คำพูดและน้ำเสียงประกอบกับความสามารถในการเล่าเรื่องราวให้น่าสนใจถือว่าเป็นองค์ประกอบหลักของการประกอบอาชีพนี้ สิ่งที่ต้องให้ความสำคัญคือ การพูดให้ผู้ชมรู้สึกสนุกเพลิดเพลินชวนให้ติดตาม โดยการแสดงสีหน้า อารมณ์ การเลือกใช้น้ำเสียงและคำพูด เทคนิคการพูดที่สำคัญคือ เปล่งเสียงออกมาให้ชัดเจน เต็มเสียง ฉะฉาน ฟังแล้วเข้าใจง่าย โดยไม่พูดงึมงำอยู่ในลำคอ และสิ่งที่ต้องให้ความสำคัญเป็นอย่างมากคือ การเลือกใช้คำพูดที่เหมาะกับกลุ่มผู้ฟังซึ่งจะทำให้สร้างความเชื่อมโยงได้ง่าย',
          imgSrc: 'game-caster/สื่อสาร.png',
        },
        {
          title: 'การตัดต่อวิดีโอให้มีความน่าสนใจ',
          description:
            'เป็นทักษะจำเป็นที่ต้องนำมาใช้ควบคู่กับความคิดสร้างสรรค์ ผู้ที่ประกอบอาชีพนี้ควรมีความรู้เบื้องต้นเกี่ยวกับการตัดต่อวิดีโออยู่บ้าง โดยเลือกโปรแกรมการตัดต่อที่เหมาะกับความถนัดของตัวเองก่อนเป็นอันดับแรก และพยายามเรียนรู้การใช้เทคนิคพิเศษต่างๆ เพิ่มเติม เช่น การใส่ภาพประกอบ เอฟเฟกต์ต่างๆ การใส่ข้อความ หรือการเพิ่มเสียงดนตรี ซึ่งจะช่วยให้เนื้อหามีสีสันและมีความน่าสนใจมากยิ่งขึ้น',
          imgSrc: 'game-caster/ตัดต่อวิดีโอ.png',
        },
        {
          title: 'มีความคิดสร้างสรรค์',
          description:
            'ทุกครั้งก่อนที่จะเริ่มแคสเกมหรือตัดต่อวิดีโอ Gamecaster ควรจะใช้ความคิดสร้างสรรค์ เพื่อคิดวางแผนรูปแบบการนำเสนอวิดีโอว่าต้องการที่จะสื่อสารเรื่องอะไร ผู้รับชมจะได้รับรู้อะไรจากวิดีโอนี้ โดยจินตนาการหรือคิดภาพในหัวก่อนว่าจะตัดต่อแบบไหน ใส่เอฟเฟกต์อะไร เพื่อที่จะเพิ่มลูกเล่นให้กับวิดีโอ ซึ่งจะช่วยทำให้ทำงานได้ง่ายขึ้นและผลงานออกมาน่าสนใจ ความคิดสร้างสรรค์จะทำให้มีรูปแบบวิดีโอที่หลากหลายไม่ซ้ำแบบใคร จะช่วยให้มีจำนวนผู้ติดตามเพิ่มมากขึ้น',
          imgSrc: 'game-caster/ความคิดสร้างสรรค์.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/game-caster/character.png"
      :characterDetails="[
        'กล้าแสดงออก กล้าพูด กล้าทำ ไม่เขินอาย',
        'สนุกสนาน หยอดมุก ตลก เฮฮา',
        'มีความมั่นใจในตัวเอง เชื่อในสิ่งที่ตัวเองพูดและทำ',
        'วางตัวอย่างเหมาะสมบนโซเชียลมีเดีย อ่อนน้อมถ่อมตน รู้จักกาลเทศะ',
        'สร้างเอกลักษณ์เฉพาะตัว มีสไตล์เป็นของตัวเอง',
      ]"
      roleImg="@/assets/job/game-caster/role.png"
      :roles="[
        {
          title: 'ตัดต่อวิดีโอ',
          description: 'และอัปโหลดวิดีโอ ประมาณ 2-3 ชั่วโมง',
        },
        {
          title: 'ศึกษาข้อมูลเกมและอัปเดตข่าวสาร',
          description:
            'ทำความเข้าใจในตัวเกมและคอยอัปเดตข่าวสารใหม่ๆ ที่เกี่ยวกับเกมทั้งในประเทศและต่างประเทศ',
        },
        {
          title: 'เล่นเกมหรือแคสเกม',
          description: 'ประมาณ 4-5 ชั่วโมงต่อครั้ง',
        },
      ]"
      :incomeDescription="`
      รายได้เฉลี่ย 40,000-500,000 บาทต่อเดือน โดยตัวกำหนดรายได้ของ Gamecaster มีปัจจัยหลักที่สำคัญคือ จำนวน subscribers และสไตล์ที่เป็นเอกลักษณ์ประกอบกับคุณภาพของวิดีโอที่มีเนื้อหาที่น่าสนใจ โดยมีที่มาของรายได้ ดังนี้

      `"
      :roleAddition="`
        <ol class='pl-4 text-left' style='list-style-type:decimal'>
          <li>รายได้จากแพลตฟอร์มออนไลน์ เช่น Youtube Facebook หรือ Twitch ตามอัตรารายได้ ซึ่งคำนวณจากจำนวน subscribers และจำนวนผู้รับชมวิดีโอแต่ละตัว หากผู้ชมมีจำนวนมากก็จะทำให้ได้รับรายได้มากขึ้น นอกจากนี้ ยังมีส่วนแบ่งค่าโฆษณาที่ปรากฏบนแพลตฟอร์มนั้น ๆ หรือเงินเดือนในกรณีที่จ้างเป็นสัญญาให้ลงวิดีโอเฉพาะแพลตฟอร์ม ซึ่งไม่จำเป็นจะต้องขึ้นกับสังกัดใด สามารถสร้างผลงานขึ้นมาเองได้</li>
          <li>ค่าจ้างจากการโฆษณา Gamecaster จะได้รับการว่าจ้างให้โปรโมทสินค้า และบริการต่างๆ ที่จะทำให้เกิดความสนใจจากกลุ่มเป้าหมาย โดยได้รับค่าจ้างจากการโฆษณสินค้านั้นๆ เป็นเงินเดือนหรือเป็นครั้ง ขึ้นอยู่กับข้อตกลง</li>
          <li>รายได้จากการสนับสนุนหรือบริจาค โดยได้รับจากผู้ชมที่ชื่นชอบผลงาน ซึ่งจ่ายให้ Gamecaster โดยตรงผ่านแพลตฟอร์มออนไลน์ </li>
          <li>ค่าจ้างในการเป็นพรีเซนเตอร์สินค้าหรือการออกงาน Event โดยส่วนมากจะมีการจ้างงานเป็นครั้งคราว ซึ่ง Gamecaster ที่มีชื่อเสียงและเป็นที่นิยมจะได้รับการว่าจ้าง </li>
        </ol>
      `"
      :recommendLv="[
        'ศึกษาค้นคว้าข้อมูล ก่อนที่จะทำคลิปวิดีโอ ต้องศึกษาข้อมูลเรื่องเกมและค้นหาประเด็นเกี่ยวกับเกมที่ตัวเองสนใจจะใช้เป็นเนื้อหา ซึ่งสามารถเรียนรู้ด้วยตัวเองจากอินเทอร์เน็ตหรือจาก Youtube จากทั้งของไทยและต่างประเทศ เพราะจะได้รับความรู้จากเนื้อหาที่หลากหลายและครอบคลุมมากกว่า เช่น บางครั้งอาจจะนำสไตล์จากต่างประเทศมาประยุกต์ใช้กับการสร้างวิดีโอของตัวเอง',
        'วางกลยุทธ์ วางรูปแบบการนำเสนอ Gamecaster จำเป็นต้องคิดเนื้อหา (Content) หรือรูปแบบการนำเสนอคลิปวิดีโอว่า จะพูดอะไรกับผู้ชม จะให้ผู้ชมได้เห็นหรือรับรู้เรื่องราวแบบใด จะทำคลิปออกมาแนวไหน และจะเล่นเกมอะไรเพื่อเป็นสื่อกลาง แต่สิ่งที่สำคัญที่สุดคือ สร้างเนื้อหาในรูปแบบที่ชอบและถนัด ที่สุดในรูปแบบของตัวเอง โดยอาจจะศึกษาสไตล์การทำคลิปวีดิโอของ Gamecaster คนอื่น แล้วนำเทคนิคมาปรับใช้ก็ได้',
        'อย่ารีรอ ทำเลย เมื่อคิดที่จะทำแล้วก็ให้เริ่มลงมือทำเลย ถึงแม้ว่าอุปกรณ์จะยังไม่ครบ แต่หากต้องการเริ่มต้น สามารถเริ่มจากการใช้สมาร์ทโฟน หรือคอมพิวเตอร์ที่มีอยู่โดยไม่ต้องรอลงทุนซื้ออุปกรณ์ราคาแพง เมื่อเริ่มมีผู้ติดตาม มีฝีมือมากขึ้น หรือเริ่มมีรายได้แล้ว จึงเริ่มลงทุนกับอุปกรณ์อื่นๆ หรือเริ่มจ้างทีมงาน',
        'คุณภาพต้องมาก่อน ควรคำนึงถึงการทำวิดีโอออกมาให้มีคุณภาพมากที่สุด ทั้งด้านเนื้อหาและรูปแบบการนำเสนอ คุณภาพสำคัญกว่าจำนวนวิดีโอ เพราะหากผลิตวิดีโอออกมาจำนวนมากแต่ไม่มีคุณภาพก็จะไม่มีผู้รับชม แต่หากตั้งใจผลิตวิดีโอให้มีคุณภาพ ถึงแม้จำนวนวิดีโอจะไม่มากแต่ทำให้มีจำนวนผู้รับชมจำนวนมาก และค่อยๆ ใช้เวลาในการสร้างฐานจำนวนผู้ติดตาม วิดีโอที่มีคุณภาพและ Gamecaster ที่นำเสนอเนื้อหาคุณภาพ จะมีผู้ติดตามรับชมอย่างต่อเนื่อง ถึงแม้ว่าจะเป็นการโฆษณาสินค้า แต่ถ้าเป็นวิดีโอที่สอดแทรกเรื่องราวที่น่าสนใจก็ยังไม่ทำให้ผู้ชมรู้สึกว่าถูกยัดเยียดขายของ',
      ]"
      recommendCourseDescription="จะเห็นได้ว่าอาชีพ Gamecaster มีทักษะที่จำเป็น ได้แก่ ทักษะทางด้านภาษา การสื่อสาร ซึ่งควรศึกษาการใช้ภาษาที่ถูกต้องและสื่อความหมายชัดเจน รวมไปถึงการใช้ภาษาต่างประเทศ และทักษะด้านการตัดต่อวิดีโอ โดยศึกษาตั้งแต่ขั้นตอนการลำดับเรื่องราวและเทคนิคการตัดต่อวิดีโอให้น่าสนใจ"
      recommendImg="@/assets/job/game-caster/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: 'ด้านภาษาและการสื่อสาร',
          details: [
            {
              place: 'คณะอักษรศาสตร์',
              courses: [],
            },
            {
              place: 'คณะศิลปศาสตร์ ',
              courses: [],
            },
            {
              place: 'คณะนิเทศศาสตร์',
              courses: ['ภาควิชาการสื่อสารมวลชน', 'ภาควิชาการประชาสัมพันธ์'],
            },
          ],
        },
        {
          header: 'ด้านการตัดต่อวิดีโอ',
          details: [
            {
              place: 'คณะดิจิทัลมีเดียและศิลปะภาพยนตร์',
              courses: ['สาขาวิชาภาพยนตร์', 'สาขาวิชาสื่อดิจิทัล'],
            },
            {
              place: 'คณะนิเทศศาสตร์',
              courses: ['สาขาวิชาการภาพยนตร์และภาพนิ่ง'],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'

export default Vue.extend({
  name: 'GameCaster',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/game-caster/main.png'),
      title: 'เกมแคสเตอร์',
      subTitle: '(Game Caster)',
      description:
        'ในต่างประเทศอาจเรียกว่า Game Commentator คือ อาชีพด้านการผลิตสื่อในรูปแบบวิดีโอเพื่อเผยแพร่ในช่องทางออนไลน์ต่างๆ โดยบันทึกภาพขณะตัวเองกำลังเล่นเกม พร้อมทั้งมีการพูดคุยนำเสนอเรื่องราวต่างๆ ที่มีความเกี่ยวข้องกับเกมที่กำลังเล่นอยู่ ซึ่งเรียกว่า “การแคสเกม” สำหรับเนื้อหาหลักๆ ที่ใช้ในการผลิตวิดีโอ ได้แก่ การรีวิวแนะนำหรือวิจารณ์เกมที่กำลังป็นที่นิยม การสอนเทคนิคในการเล่นเกม การสอนภาษาอังกฤษหรือพูดคุยเรื่องต่างๆ ผ่านการใช้เกมเป็นสื่อกลาง เพื่อจุดประสงค์ในการให้ความบันเทิงกับผู้รับชม โดยมีการตัดต่อวิดีโอให้มีความน่าสนใจและน่าติดตามด้วยเทคนิคการใส่รูป เอฟเฟกต์ภาพและเสียงต่างๆ เพื่อมอบความบันเทิงและความสนุกสนานให้กับผู้รับชมได้ติดตาม โดยจำนวนผู้ติดตามรับชม (subscribers) จะมากหรือน้อยขึ้นอยู่กับสไตล์ ความสร้างสรรค์ในการผลิตวิดีโอให้ตรงใจกลุ่มเป้าหมาย ซึ่งจำนวน subscribers ยังเป็นปัจจัยที่มีความเกี่ยวข้องกับรายได้อีกด้วย อาชีพ Gamecaster สามารถฝึกฝนและพัฒนาตัวเองได้ เนื่องจากไม่มีหลักสูตรการเรียนการสอนและกำลังเป็นอาชีพทางเลือกที่มาแรงสำหรับคนรุ่นใหม่ที่รักการเล่นเกม และมีทักษะในการตัดต่อวิดีโอ',
    }
  },
  head() {
    const instance: any = this

    return {
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: instance.description,
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
