<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/9eTB-06gikQ"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription="กว่าจะมาเป็น Shoutcaster ที่มีความเป็นมืออาชีพ สามารถบรรยายได้ลึกซึ้งถึงกลยุทธ์ในการแข่งขันและสร้างความสนุกตื่นเต้นให้กับผู้รับชมได้ตลอดการแข่งขัน จะต้องมีคุณสมบัติและทักษะ ดังนี้"
      :skills="[
        {
          title: 'ทักษะการสื่อสารที่เป็นเลิศ',
          description:
            'ข้อนี้สำคัญที่สุด เพราะจำเป็นต้องใช้ทักษะด้านภาษาและน้ำเสียงในการสื่อสารกับผู้ชม โดยส่วนใหญ่แล้วจะเป็นการพากย์หรือบรรยายเกมการแข่งขันแบบถ่ายทอดสดไปยังผู้ชมจำนวนมาก Shoutcaster ต้องเลือกใช้คำพูดนำเสนอเรื่องราวต่างๆ อย่างชัดเจน ถูกต้องและเหมาะสม รวมถึงสร้างอารมณ์ร่วมกับผู้ชมที่กำลังชมการแข่งขัน คล้ายคลึงกับการพากย์ฟุตบอลนั่นเอง',
          imgSrc: 'shout-caster/สื่อสาร.png',
        },
        {
          title: 'แก้ไขปัญหาเฉพาะหน้าได้ดี',
          description:
            'หลายคนอาจจะสงสัยว่าทักษะนี้เกี่ยวข้องอะไร เหตุผลหลักคือ Shoutcaster ต้องพากย์เกมการแข่งขันถ่ายทอดสด ซึ่งอาจเกิดเหตุการณ์ที่ไม่คาดคิดขึ้นได้ตลอดเวลา เช่น สัญญาณภาพไม่เสถียร ไฟดับ หรือเหตุการณอื่นๆ ที่อาจไม่เคยเกิดขึ้นและไม่ทันได้เตรียมตัว ทำให้ผู้ที่เป็น Shoutcaster ต้องทำหน้าที่ควบคุมสถานการณ์และสื่อสารให้ผู้ชมได้เข้าใจ',
          imgSrc: 'shout-caster/แก้ปัญหาเฉพาะหน้า.png',
        },
        {
          title: 'มีความเข้าใจเกี่ยวกับเกม',
          description:
            'อาชีพนี้ต้องรู้จักและมีความเข้าใจในหลากหลายประเด็นที่มีความเกี่ยวข้องกับองค์ประกอบทั้งหมดของเกมและการแข่งขัน ไม่ว่าจะเป็นความรู้เกี่ยวกับนักกีฬา ประวัติความเป็นมาของทีมหรือสโมสร สไตล์การแข่งขัน รวมไปถึงเทคนิคต่างๆ หรือสามารถวิเคราะห์จุดแข็งจุดอ่อนของนักกีฬาแต่ละคนได้ ซึ่งหากมีความรู้ทั้งหมดนี้ก็จะสามารถหยิบยกประเด็นต่างๆ มาใช้เวลาที่พากย์การแข่งขันได้อย่างสร้างสรรค์และน่าเชื่อถือ',
          imgSrc: 'shout-caster/เข้าใจเกม.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/shout-caster/character.png"
      :characterDetails="[
        'เป็นตัวของตัวเอง ดึงความเป็นธรรมชาติของตัวเองออกมา สร้างจุดเด่นและเอกลักษณ์เฉพาะตัว',
        'กล้าแสดงออก กล้าแสดงความสามารถต่อผู้ชมจำนวนมาก',
        'มีความมั่นใจในตัวเอง มั่นใจในสิ่งที่นำเสนอ ด้วยข้อมูลที่ถูกต้องชัดเจน',
        'รู้จักกาลเทศะ ใช้คำพูด น้ำเสียง กิริยาท่าทางที่เหมาะสมระหว่างพากย์เกม',
        'วางตัวอย่างเหมาะสมบนโซเชียลมีเดีย อ่อนน้อมถ่อมตน รู้จักกาลเทศะ',
      ]"
      roleImg="@/assets/job/shout-caster/role.png"
      :roles="[
        {
          title: 'พากย์เกมการแข่งขัน',
          description: 'ระยะเวลาระหว่าง 30 นาทีไปจนถึงมากกว่า 3 ชั่วโมง',
        },
        {
          title: 'เล่นเกม',
          description: 'เพื่ออัปเดตข้อมูลให้เข้าใจบริบทและหลักการของเกมมากขึ้น',
        },
        {
          title: 'ศึกษาหาความรู้เกี่ยวกับเกม',
          description: 'ติดตามข่าวสารต่างๆ ที่เกี่ยวข้องกับเกมการแข่งขัน',
        },
      ]"
      :incomeDescription="`
      รายได้เฉลี่ย 50,000-150,000 บาทต่อเดือน รายได้โดยเฉลี่ยของอาชีพนี้ สามารถแบ่งได้เป็น 3 แบบ ขึ้นอยู่กับประสบการณ์การทำงาน ความสามารถ และความมีชื่อเสียงของแต่ละคน
        <ol class='pl-4 mt-3 text-left' style='list-style-type:decimal'>
          <li>เรทครึ่งวัน เฉลี่ยอยู่ที่ 3,000-6,000 บาท</li>
          <li>เรทรายวัน เฉลี่ยอยู่ที่ 7,000-10,000 บาท</li>
          <li>เรทรายเดือน อาจได้รับเป็นเงินเดือน ขึ้นอยู่กับบริษัทต้นสังกัด</li>
        </ol>
      `"
      :roleAddition="`
        นอกจากนี้ ยังมีงานเสริมที่เพิ่มรายได้เข้ามา เช่น การรับงานรีวิวเกมหรือสินค้าประเภทต่างๆ งนี้ ยังสามารถแบ่งรายได้ของ Shoutcaster ได้จากประเภทของการจ้างงาน คือ พนักงานประจำ (full time) และรับงานอิสระ (freelance)
        <ol class='pl-4 mt-3 text-left' style='list-style-type:decimal'>
          <li>พนักงานประจำ (full time) ได้รับรายได้เป็นประจำทุกเดือน รวมถึงมีสวัสดิการอื่นๆ เช่น ค่ารักษาพยาบาล ประกันสังคม วันหยุดพักร้อน เช่นเดียวกับพนักงานบริษัททั่วๆ ไป จุดที่ทำให้หลายคนพิจารณาเกี่ยวกับการเป็นพนักงานประจำคือ ความอิสระในการเลือกงานและเวลาการทำงาน เพราะต้องปฏิบัติตามระเบียบของบริษัท เช่น เวลาการเข้าออกงาน พากย์เกมการแข่งขันเพียงบางเกมเท่านั้น นอกจากนี้ ยังมีงานอื่นๆ ที่ได้รับมอบหมายเพิ่มเติมเช่นเดียวกับพนักงานบริษัททั่วไป</li>
          <li>รับงานอิสระ (freelance) มีความอิสระและความยืดหยุ่นเกี่ยวกับจำนวนและระยะเวลาในการทำงาน แต่ต้องมีการบริหารจัดการเวลาให้ดี รายได้ไม่แน่นอนขึ้นอยู่กับจำนวนงานที่รับและข้อตกลงกับผู้ว่าจ้างในแต่ละงาน มีอิสระในการเลือกพากย์เกมที่หลากหลายได้ตามความสนใจ </li>
        </ol>
      `"
      :recommendLv="[
        'สลัดความเขินอายออกไป อาชีพนี้ต้องอยู่หน้ากล้อง มีการตัดภาพสลับกันระหว่างเกมการแข่งขันและใบหน้าของนักพากย์ จึงไม่ควรที่จะอายหรือเขินกล้อง ควรฝึกฝนการพูดในที่สาธารณะให้เกิดความคุ้นเคยและเกิดความลื่นไหลในการใช้ภาษา เพื่อสื่อสารไปยังผู้รับชม',
        'เพิ่มความมั่นใจ ความเชื่อมั่นในตัวเองเป็นสิ่งสำคัญ เพราะจะเป็นกระจกสะท้อนให้ผู้ชมเกิดความเชื่อมั่นในข้อมูลที่ถูกบอกเล่าโดยนักพากย์ด้วย โดยต้องมีความมั่นใจในความถูกต้องของข้อมูลที่มีเสียก่อน ด้วยการศึกษาหาความรู้จากแหล่งข้อมูลที่ถูกต้อง',
        'ไม่หยุดพัฒนาตัวเอง Shoutcaster เป็นอาชีพที่ต้องรู้จักและเข้าใจเกมหรืออีสปอร์ตที่จะพากย์เป็นอย่างดี ดังนั้นจึงต้องศึกษาหาความรู้อยู่ตลอดเวลา เพื่อนำเสนอข้อมูลใหม่ๆ บอกเล่าให้ผู้ชมได้รับฟัง การมีความรู้ที่หลากหลายจะทำให้เป็นที่น่าเชื่อถือ เพิ่มโอกาสในการทำงานและสามารถอยู่ในวงการได้อย่างยาวนาน ',
      ]"
      recommendAddtion="ในปัจจุบันผู้ประกอบอาชีพ Shoutcaster ยังมีจำนวนค่อนข้างน้อย บางคนจึงอาจคิดว่าโอกาสในอาชีพนี้จะน้อยตามไปด้วย แต่ในความเป็นจริงแล้ว อาชีพนี้เป็นอาชีพที่มีจำนวนงานรองรับอยู่มาก โดยดูได้จากการขยายตัวของอุตสาหกรรมเกมและจำนวนผู้เล่นเกมที่มีเพิ่มมากขึ้น หากมีความสามารถและทักษะตามข้างต้น และมีความสนใจด้านเกมจริงๆ สิ่งเหล่านี้จะเป็นกุญแจสำคัญในการเปิดประตูสู่โลกของอาชีพ Shoutcaster"
      recommendCourseDescription="ถึงแม้ว่าในขณะนี้จะยังไม่มีการเปิดสอนหลักสูตรในการพากย์การแข่งขันเกมโดยตรง แต่สาขาวิชาที่มีความเกี่ยวข้องกับอาชีพนี้ ได้แก่ สาขาทางด้านสื่อสารมวลชน แน่นอนว่าการเป็น Shoutcaster จะต้องทำงานผ่านช่องทางสื่อสารต่างๆ ไม่ว่าจะเป็นสื่อออนไลน์อย่าง Facebook Youtube หรือโทรทัศน์ ซึ่งการที่ได้เรียนในสาขานี้โดยตรง จะทำให้ได้เปรียบในเรื่องของการพูดในที่สาธารณะอย่างมีลำดับขั้นตอน เข้าใจถึงการทำงานและวิธีการในการถ่ายทอดสด และสาขาทางด้านภาษา การเรียนในสาขานี้มีส่วนช่วยในเรื่องการพูด การเลือกใช้ภาษาที่ถูกต้องและเหมาะสม การใช้ภาษาต่างประเทศได้อย่างคล่องแคล่ว ซึ่งจะเพิ่มโอกาสในการพากย์การแข่งขันเกมระดับนานาชาติในต่างประเทศอีกด้วย"
      recommendImg="@/assets/job/shout-caster/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: 'ด้านสื่อสารมวลชน',
          details: [
            {
              place: 'คณะนิเทศศาสตร์',
              courses: [],
            },
            {
              place: 'คณะวารสารศาสตร์และสื่อสารมวลชน',
              courses: [],
            },
            {
              place: 'คณะมนุษยศาสตร์',
              courses: ['ภาควิชานิเทศศาสตร์และสารสนเทศศาสตร์  '],
            },
            {
              place: 'คณะเทคโนโลยีสารสนเทศและการสื่อสาร',
              courses: [],
            },
          ],
        },
        {
          header: 'ด้านภาษา',
          details: [
            {
              place: 'คณะอักษรศาสตร์',
              courses: [],
            },
            {
              place: 'คณะศิลปศาสตร์',
              courses: [],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'

export default Vue.extend({
  name: 'ShoutCaster',
  components: {
    JobDetail,
  },
  data() {
    return {
      title: 'นักพากย์การแข่งขันเกม',
      subTitle: '(Shout Caster)',
      description:
        'คือ ผู้บรรยายหรือพากย์การแข่งขันเกมอีสปอร์ต โดยที่ไม่ได้เป็นผู้ที่กำลังแข่งขันในเกมนั้น ซึ่งหน้าที่หลักจะเหมือนกับนักพากย์กีฬาประเภทอื่นๆ เช่น การพากย์ฟุตบอลหรือมวย โดยทำหน้าที่บรรยายเกมการแข่งขัน วิเคราะห์วิจารณ์เทคนิคการเล่นของแต่ละทีม รวมทั้งบอกเล่าเรื่องราวต่างๆ ที่เกี่ยวข้องในระหว่างการแข่งขัน เพื่อให้ผู้ชมได้รับอรรถรสในการรับชม รวมทั้งสร้างให้เกิดอารมณ์ร่วม ความสนุกสนาน และมีความเข้าใจในระหว่างรับชมมากยิ่งขึ้น เรียกได้ว่าเป็นอีกหนึ่งอาชีพสำคัญที่ช่วยสร้างสีสันให้กับวงการเกมและอีสปอร์ต',
      mainImg: require('@/assets/job/shout-caster/main.png'),
    }
  },
  head() {
    const instance: any = this

    return {
      title: 'อาชีพนักพากย์การแข่งขันเกม',
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: instance.description,
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
