<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/nuV78Yp3jAw"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription="งานของ Streamer จะเป็นลักษณะของการถ่ายทอดสด โดยไม่ผ่านการตัดต่อ ทำให้ต้องใช้ทักษะหลายด้านในเวลาเดียวกัน ดังนั้นจึงจำเป็นต้องฝึกฝนทักษะต่างๆ ให้เกิดความชำนาญ โดยมีทักษะที่สำคัญ ได้แก่"
      :skills="[
        {
          title: 'ทักษะการสื่อสารให้น่าสนใจ',
          description:
            'ทักษะการพูดนั้นถือเป็นสิ่งสำคัญของอาชีพ Streamer เพราะการถ่ายทอดสดในแต่ละครั้ง นอกจากจะต้องเล่นเกมไปด้วยซึ่งต้องใช้การประสานงานระหว่างสมอง สายตา นิ้วมือแล้ว ยังต้องพูดคุยสื่อสารกับผู้ชมไปในขณะเดียวกัน ดังนั้นการพูดคุยเล่าเรื่องราวต่างๆ จึงต้องทำให้เข้าใจง่าย ชัดเจน มีความลื่นไหลและสนุกสนาน โดยคำนึงถึงเรื่องที่จะสื่อสารออกไปและพูดโต้ตอบกับผู้ชมให้น่าสนใจและอยากติดตามต่อไป',
          imgSrc: 'streamer/สื่อสาร.png',
        },
        {
          title: 'มีความเป็นเอนเตอร์เทนเนอร์',
          description:
            'ข้อนี้ถือเป็นทักษะสำคัญสำหรับการต่อยอดฐานผู้ชม ผู้ติดตามและแฟนคลับให้เพิ่มมากขึ้น เพราะสิ่งแรกที่ผู้ชมต้องการเข้ามาดู Streamer คือ ความสนุกสนานเพลิดเพลิน Streamer จะต้องถามตัวเองก่อนว่าจะสามารถสร้างรอยยิ้มและความสุขให้กับผู้ชมได้อย่างไร เพราะไม่เพียงแค่การพูดที่ดึงดูดใจผู้ชมแล้ว ยังจะต้องสร้างความบันเทิงให้กับผู้ชมอีกด้วย',
          imgSrc: 'streamer/เอนเตอเทนเนอร์.png',
        },
        {
          title: 'รู้เรื่องคอมพิวเตอร์และวิธีการใช้โปรแกรมในการถ่ายทอดสด',
          description:
            'ซึ่งเป็นทักษะเสริมที่หาก Streamer เข้าใจการใช้งานคอมพิวเตอร์หรือโปรแกรมพื้นฐานที่ใช้ในการถ่ายทอดสดแล้ว เพราะจะช่วยให้การทำงานสะดวกและง่ายมากขึ้น เนื่องจากโดยส่วนใหญ่ผู้ที่ Streamer จะต้องถ่ายทอดสดการเล่นเกมด้วยตัวเอง โดยไม่มีทีมงานเฉพาะทางมาช่วยเหลือ ดังนั้นหากสามารถที่จะถ่ายทำได้ด้วยตัวเอง จะช่วยทำให้งานเสร็จเร็วขึ้นและมีเนื้อหาตรงตามไอเดียที่วางแผนไว้',
          imgSrc: 'streamer/ถ่ายทอด.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/streamer/character.png"
      :characterDetails="[
        'กล้าแสดงออก มั่นใจในสิ่งที่จะพูดและนำเสนอ',
        'เป็นตัวของตัวเอง มีเอกลักษณ์เฉพาะตัว',
        'ควบคุมอารมณ์ได้ดี การแสดงออกทางสีหน้า หน้าตา รวมถึงน้ำเสียง',
        'มีความมั่นใจในตัวเอง เชื่อในสิ่งที่ตัวเองพูดและทำ ',
        'วางตัวอย่างเหมาะสมบนโซเชียลมีเดีย อ่อนน้อมถ่อมตน รู้จักกาลเทศะ',
      ]"
      roleImg="@/assets/job/streamer/role.png"
      :roles="[
        {
          title: 'ตัดต่อวิดีโอ',
          description: 'เป็นคลิปไฮไลต์ เพื่อให้ผู้ชมสามารถรับชมย้อนหลัง',
        },
        {
          title: 'ตอบคำถามผู้ชม',
          description: 'สื่อสารตอบกลับความคิดเห็นของผู้ชมอย่างสม่ำเสมอ',
        },
        {
          title: 'เตรียมอุปกรณ์ถ่ายทอดสด',
          description: 'เช่น คอมพิวเตอร์ ระบบอินเทอร์เน็ต',
        },
        {
          title: 'เตรียมเนื้อหาที่จะนำเสนอ',
          description: 'เนื้อหาเกี่ยวกับเกมที่จะเล่นถ่ายทอดสด',
        },
        {
          title: 'ตรวจสอบความคิดเห็น',
          description: 'ข้อเสนอแนะหรือคำถามของผู้ชม เพื่อนำมาปรับปรุง',
        },
      ]"
      :incomeDescription="`
        รายได้เฉลี่ย 10,000-100,000 บาทต่อเดือน
        <ol class='pl-4 mt-3 text-left' style='list-style-type:decimal'>
          <li>
            Streamer ที่มีสังกัด (Agency) รายได้เฉลี่ยอยู่ที่ประมาณ 10,000-100,000 บาทต่อเดือน
            <ol class='pl-4 mt-3 text-left' style='list-style-type:decimal'>
              <li>รายได้จากจำนวนยอดผู้ชม ต้นสังกัดจะมีการกำหนดรายได้จากจำนวนผู้รับชม ยิ่งจำนวนผู้รับชมมีจำนวนมากก็จะทำให้ได้รับรายได้มากขึ้นตามไปด้วย</li>
              <li>รายได้จากงานเสริม เช่น การรับรีวิวโฆษณาสินค้า หรือการรับร่วมงาน event ต่างๆ</li>
              <li>สวัสดิการและสิทธิประโยชน์ มีผู้จัดการส่วนตัวที่คอยดูแล Streamer ในการประสานงานต่าง ๆ</li>
            </ol>
          </li>
          <li>
            Streamer อิสระ (freelance) รายได้เฉลี่ยอยู่ที่ประมาณ 10,000-40,000 บาทต่อเดือน
            <ol class='pl-4 mt-3 text-left' style='list-style-type:decimal'>
              <li>รายได้จากการถ่ายทอดสดบนแพลตฟอร์ม ซึ่งจะมีการมอบเงินจากผู้รับชมในรูปแบบสัญลักษณ์ของขวัญ ซึ่งของขวัญแต่ละชนิดจะมีมูลค่าเท่าใดขึ้นอยู่กับแพลตฟอร์มเป็นผู้กำหนด</li>
              <li>รายได้จากงานเสริม เช่น การรีวิวโฆษณาสินค้า รีวิวเครื่องดื่ม อาหาร ขณะกำลังเล่นเกม ซึ่ง Streamer ประเภทนี้จะมีอิสระในการเลือกรับสินค้าที่มาว่าจ้างได้ด้วยตัวเอง</li>
            </ol>
          </li>
        </ol>
      `"
      :recommendLv="[
        'ค้นหาตัวเอง เพื่อให้พบจุดเด่นหรือความสนใจพิเศษที่จะเป็นประโยชน์ต่อการสร้างสรรค์เนื้อหาในการเป็น Streamer และสำรวจตัวเองว่ายังมีข้อบกพร่องใดที่สามารถพัฒนาได้ เช่น อาจจะเป็นคนที่กล้าแสดงแต่ยังพูดไม่เก่ง ก็ควรฝึกฝนการพูดเพิ่ม หรือตั้งเป้าหมายให้ตัวเองก่อนว่าอยากมีตัวตนแบบไหนในวงการเกม เช่น ถ้าอยากเป็นผู้เล่นที่เก่งก็ตั้งเป้าไปเลยว่าจะเก็บ rank หรืออันดับในการแข่งขันเกมแต่ละเกม หรือจะเป็น Streamer สายตลก ก็ควรจะมีคลังข้อมูลและมุกตลก เพื่อสร้างความบันเทิงให้กับผู้รับชม',
        'ลงมือทำ หลังจากค้นพบแล้วว่า ตัวเองมีจุดแข็ง จุดอ่อนอะไร เช่น Streamer บางคนมีจุดเด่นคือ เล่นเกมเก่ง ก็อาจจจะนำเสนอในรูปแบบสอนวิธีการเล่นเกม หรือบางคนอาจนำเสนอแนวสนุกสนาน โดยพูดตลก ทำท่าทางตลก สร้างเสียงหัวเราะให้กับผู้ชม และตรวจสอบข้อคิดเห็นและคำแนะนำอยู่เสมอ เพื่อพัฒนาตัวเอง โดยไม่จำเป็นต้องรอให้เก่งทุกอย่างแล้วจึงลงมือทำ เพราะการลงมือทำก็เหมือนการฝึกฝนทักษะต่างๆ ไปด้วยในตัวอยู่แล้ว',
        'เรียนรู้และไม่ย่อท้อ หลังจากได้ทำการถ่ายทอดสดไปแล้ว Streamer ก็จะทราบถึงปัญหาและข้อผิดพลาดที่เกิดขึ้นระหว่างการทำงาน นอกจากนี้ยังจะได้รับ feedback คำติชมหรือแนะนำกลับมาจากผู้ชมอีกด้วย ซึ่งควรเรียนรู้จากข้อผิดพลาดที่เกิดขึ้น แล้วนำไปปรับปรุงพัฒนา เพื่อมาปรับใช้กับการทำงานในครั้งต่อๆ ไป',
      ]"
      recommendCourseDescription="อาชีพ Streamer เป็นอาชีพใหม่สำหรับผู้ที่มีใจรักในการเล่นเกมและสร้างความบันเทิงให้กับผู้รับชม จึงไม่มีการเรียนการสอนที่เฉพาะเจาะจง แต่สามารถฝึกฝนทักษะต่างๆ ที่จำเป็นสำหรับการทำงานนี้ได้ด้วยตัวเอง อย่างไรก็ตาม สำหรับสาขาวิชาที่มีส่วนช่วยในการส่งเสริมและพัฒนาทักษะในสายอาชีพนี้ ได้แก่ สาขาทางด้านภาษาและการสื่อสาร Streamer ต้องใช้ทักษะการพูดและสื่อสารอยู่ตลอดเวลา เพราะงานหลักคือ การสื่อสารให้ผู้ชมสนุกสนานและเข้าใจในเกมที่เล่นมากขึ้น ซึ่งถ้าหากเลือกเรียนสาขาด้านนี้ก็จะได้เปรียบในเรื่องของการใช้ภาษาและวิธีการพูดอย่างเหมาะสม และอีกสาขาหนึ่งที่มีความเกี่ยวข้องคือ ด้านคอมพิวเตอร์ โดยจะมีส่วนช่วยอย่างมาก โดยเฉพาะผู้เริ่มต้นอาชีพ Streamer เพราะจะทำให้ทราบว่าสามารถนำอุปกรณ์คอมพิวเตอร์ต่างๆ มาใช้ประกอบการทำงานได้อย่างไร รวมทั้งรู้จักการทำเทคนิคต่างๆ ด้วยโปรแกรมสำเร็จรูป และเมื่อเกิดปัญหาขึ้นระหว่างการถ่ายทอดสดก็สามารถแก้ไขได้ทันที"
      recommendImg="@/assets/job/streamer/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: 'ด้านภาษาและการสื่อสาร',
          details: [
            {
              place: 'คณะอักษรศาสตร์',
              courses: [],
            },
            {
              place: 'คณะศิลปศาสตร์',
              courses: [],
            },
            {
              place: 'คณะนิเทศศาสตร์',
              courses: ['ภาควิชาการสื่อสารมวลชน', 'ภาควิชาการประชาสัมพันธ์'],
            },
          ],
        },
        {
          header: 'ด้านคอมพิวเตอร์',
          details: [
            {
              place: 'คณะวิทยาศาสตร์และเทคโนโลยี',
              courses: ['ภาควิชาวิทยาการคอมพิวเตอร์'],
            },
            {
              place: 'คณะเทคโนโลยีสารสนเทศและนวัตกรรม',
              courses: [],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'

export default Vue.extend({
  name: 'Streamer',
  components: {
    JobDetail,
  },
  data() {
    return {
      title: 'สตรีมเมอร์',
      subTitle: '(Streamer)',
      description:
        'อาชีพในฝันอันดับต้นๆ ของเหล่าเกมเมอร์ผู้ชื่นชอบการเล่นเกม ซึ่งลักษณะงานของ Streamer คือ การเล่นเกมออนไลน์และมีการถ่ายทอดสด (live streaming) แบบเรียลไทม์ผ่านช่องทางต่างๆ อาทิ YouTube Facebook หรือ Twitch ซึ่งในขณะที่เล่นเกมออนไลน์ถ่ายทอดสดนั้น ก็จะพูดคุยเรื่องราวต่างๆ ทั้งที่อาจจะเกี่ยวกับเกมหรือไม่เกี่ยวกับเกมที่กำลังเล่นอยู่ก็ได้ เพื่อให้ผู้รับชมเกิดความสนุกสนาน โดยเนื้อหาที่นำเสนอในการพูดคุยอาจจะเป็นการสอนวิธีการเล่นเกม เทคนิคการเล่นเกม เคล็ดลับการเล่นให้ชนะ เปรียบเสมือนพิธีกรจัดรายการถ่ายทอดสด',
      mainImg: require('@/assets/job/streamer/main.png'),
    }
  },
  head() {
    const instance: any = this

    return {
      title: 'อาชีพสตรีมเมอร์',
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: instance.description,
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
