<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/w8ilyUbYp-k"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription="การทำงานด้าน eSports Broadcast นั้นเป็นสายงานที่จะต้องทำงานเป็นทีม ต้องอาศัยความเชี่ยวชาญจากบุคคลหลายๆ ฝ่ายมาผสานกันจนกลายเป็นงาน Production ที่ดีขึ้นมา ทุกคนในทีมจึงอาจจะมีความรู้ ทักษะ และความเชี่ยวชาญที่แตกต่างกันไป แต่อย่างไรก็ตามคุณสมบัติหลักที่ทุกคนในทีมไม่ว่าจะตำแหน่งงานไหนจะต้องมีเหมือนกัน ได้แก่"
      :skills="[
        {
          title: 'มี Passion ในด้านเกม',
          description:
            'มีความสนใจหรือชื่นชอบในการเล่นเกม เพราะทุกคนในทีมจะต้องมีความรู้เรื่อง “เกม” เป็นอย่างดี ควรจะต้องรู้รายละเอียดของแต่ละเกม รวมถึงจะต้องเข้าใจในผู้เล่นที่เป็นนักกีฬาแต่ละคนด้วย ทำให้การถ่ายทอดการแข่งขันมีความน่าสนใจ สามารถที่จะโฟกัสจุดสำคัญต่างๆ ได้',
          imgSrc: 'esport-team/แพสชั่นเกม.png',
        },
        {
          title: 'ทักษะการใช้เครื่องมือและอุปกรณ์',
          description:
            'ทักษะพื้นฐานคือต้องมีความรู้และใช้เครื่องมือเกี่ยวกับงานวิทยุโทรทัศน์ได้ อาทิ ใช้กล้องถ่ายภาพ กล้องถ่ายวิดีโอ การตัดต่อภาพ การตัดต่อเสียง การเชื่อมสัญญาณถ่ายทอดสด การใส่รายละเอียดกราฟิกภาพต่างๆ และเพิ่มเติมคือ ต้องมีความเข้าใจในวิธีการเชื่อมต่อด้านภาพของเครื่อง Computer รวมถึงต้องมีความเข้าใจวิธีการเชื่อมต่อเรื่องของเสียงด้วย',
          imgSrc: 'esport-team/ใช้เครื่องมือและอุปกรณ์.png',
        },
        {
          title: 'ทักษะการสื่อสารและทำงานร่วมกันเป็นทีม',
          description:
            'ต้องทำงานเป็นทีมและจะต้องอยู่ร่วมกับคนจำนวนมาก จึงเป็นงานที่จะต้องมีการสื่อสารกับบุคคลอื่นๆ ทั้งในทีมและนอกทีมอยู่ตลอดเวลา ทักษะการสื่อสารและการปรับตัวเพื่อให้ทำงานร่วมกันได้จึงเป็นทักษะสำคัญ',
          imgSrc: 'esport-team/สื่อสาร.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/esport-team/character.png"
      :characterDetails="[
        'เป็นนักเล่าเรื่อง (Storyteller) เป็นคนชอบเล่าเรื่อง ชอบถ่ายทอดเรื่องราว ลำดับเรื่องราวได้ดี และมีกระบวนการคิดอย่างเป็นขั้นตอน',
        'ชอบความท้าทาย รักความสนุก ชอบเข้าสังคม การทำงานเป็นทีม เรียนรู้สิ่งใหม่ๆ และติดตามเทรนด์การเปลี่ยนแปลงตลอดเวลา',
        'มีความคิดสร้างสรรค์ มีไอเดียแปลกใหม่ สามารถแก้ปัญหาเฉพาะหน้าได้ดี',
        'ละเอียดรอบคอบ มีสมาธิและสามารถที่จะจดจ่ออยู่กับงานตลอดเวลาได้',
        'มีใจรักในการบริการ เพราะในการปฏิบัติงานส่วนใหญ่จะต้องเป็นไปตามความต้องการของผู้จัดงานหรือผู้ว่าจ้าง',
        'มีความอดทนสูง สามารถทำงานภายใต้แรงกดดันได้ เพราะการทำงานในด้านนี้จะมีปัจจัยมากมายที่อยู่เหนือการควบคุม',
      ]"
      roleImg="@/assets/job/esport-team/role.png"
      :roles="[
        {
          title: 'ผลิตสื่อ',
          description:
            'ที่มีเนื้อหาเกี่ยวข้องกับกีฬา eSports เพื่อนำเสนอในแพลตฟอร์มต่างๆ',
        },
        {
          title: 'Live Broadcasting',
          description: 'ดำเนินการถ่ายทอดสดกีฬา eSports ทั้งในส่วนออนไลน์และออฟไลน์',
        },
        {
          title: 'Office hours',
          description: 'ชั่วโมงการทำงานเหมือนกับพนักงานบริษัททั่วไป',
        },
      ]"
      incomeDescription="หากเป็นพนักงานประจำรายได้อาจเริ่มต้นที่ 30,000 บาทต่อเดือน ขึ้นอยู่กับประสบการณ์ตำแหน่งงานหรือหน้าที่ที่รับผิดชอบ  หากเป็นการรับงานอิสระ (Freelance) หรือเปิดบริษัทของตนเอง รายได้จะขึ้นอยู่กับจำนวนของงานที่รับจ้างทำ อาจเริ่มต้นที่ 20,000 บาทไปจนถึงหลักแสนบาทต่อเดือน"
      :recommendLv="[
        'Passion มีความสนใจในเรื่องเกมและและชื่นชอบในการถ่ายทอดประสบการณ์ต่างๆ',
        'ฝึกฝนเรียนรู้การใช้อุปกรณ์เครื่องมือ ต้องรู้ถึงวิธีการใช้งานอุปกรณ์เครื่องมือในงานภาพและเสียง',
        'รู้จักค้นหาความต้องการของผู้ชมกลุ่มเป้าหมาย ต้องเรียนรู้และทำความเข้าใจว่าผู้ชมต้องการรับรู้ในสิ่งใดบ้าง ทำอย่างไรถึงจะทำให้ผู้ชมกีฬาได้เข้าถึงความสนุกในกีฬาอย่างเต็มอรรถรส',
        'สนุกกับงานอยู่เสมอ บางครั้ง Rating ยอดวิวอาจไม่ตรงตามที่คาดหวัง แต่ถ้าทำงานนี้ด้วยความสนุกอยู่เสมอก็จะทำให้มีความสุขกับการทำหน้าที่นี้ในทุกๆ วัน',
      ]"
      recommendCourseDescription="คณะที่ควรเลือกเรียนในระดับอุดมศึกษาเพื่อสร้างความรู้และทักษะสำหรับเข้ามาสู่สายอาชีพนี้ ก็คือ คณะนิเทศศาสตร์ สาขาที่สามารถประยุกต์เข้ามาทำงานในสายนี้ ได้แก่"
      recommendImg="@/assets/job/esport-team/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: '',
          details: [
            {
              place: 'สาขา Broadcasting and Streaming Media Production',
              courses: ['การผลิตรายการระบบดิจิทัล'],
            },
            {
              place: 'สาขาวิทยุกระจายเสียงและวิทยุโทรทัศน์',
              courses: ['งานเบื้องหลังวิทยุ โทรทัศน์'],
            },
            {
              place: 'สาขาภาพยนตร์/เทคโนโลยีการถ่ายภาพและภาพยนตร์',
              courses: ['ผลิตสื่อ ผลิตรายการเขียนบท เรื่องภาพและเสียง'],
            },
            {
              place: 'สาขาประชาสัมพันธ์',
              courses: ['การวางแผนและการจัดกิจกรรมต่างๆ'],
            },
            {
              place: 'สาขาการโฆษณา',
              courses: [
                'การสร้างสรรค์งานโฆษณา การวางกลยุทธ์ประชาสัมพันธ์และการเลือกสื่อสำหรับใช้โฆษณา',
              ],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'
import striptags from 'striptags'

export default Vue.extend({
  name: 'EsportTeam',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/esport-team/main.png'),
      title: 'ทีมควบคุมการผลิตสื่อและถ่ายทอดสด',
      subTitle: '(eSports Broadcast Team)',
      description: `
        <p>คือ สายงานเบื้องหลังที่ดูแลด้านการผลิตสื่อและดำเนินการถ่ายทอดสดให้กับกีฬา eSports มีหน้าที่ถ่ายทอดข้อความและส่งสารที่นักกีฬาหรือคนในวงการ eSports ต้องการสื่อสารออกไปให้สาธารณะชนรับรู้รัและเข้าใจ ทั้งในแง่ของความรู้ ข่าวสารและความบันเทิง ผ่านภาพ เสียง และงาน Production ครอบคลุมทั้งงานกิจกรรมและ Event ที่สำคัญๆ ของ eSports </p>
        <p>ในภาพรวมจะเป็นงานเดียวกันกับเบื้องหลังในการผลิตรายการวิทยุโทรทัศน์ แต่ปรับมาใช้กับงานถ่ายทอดสดกีฬา eSports โดยเฉพาะ แต่กีฬา eSports นั้นมีรายละเอียดและความซับซ้อนที่อาจจะมากกว่ากีฬาทั่วไป นั่นจึงเป็นปัจจัยที่ทำให้มีความแตกต่างจากงานวิทยุโทรทัศน์และงานถ่ายทอดสดกีฬาทั่วไปอยู่พอสมควร</p>
      `,
    }
  },
  head() {
    const instance: any = this

    return {
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: striptags(instance.description),
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
