<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/s8ixgW7aebg"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription=""
      :skills="[
        {
          title: 'ทักษะเกี่ยวกับเกม',
          description:
            'ไม่จำเป็นที่จะต้องเล่นเกมเก่ง แต่ต้องรู้ระบบและรูปแบบของเกมต่าง ๆ ว่าแต่ละเกมเป็นเกมแบบไหน ต้องเล่นอย่างไร รวมไปถึงลูกเล่นใหม่ ๆ ของเกมที่กำลังได้รับความนิยม และฟีเจอร์แต่ละอย่างมีคุณสมบัติอย่างไร',
          imgSrc: 'esports-project-manager/เชี่ยวชาญเกม.png',
        },
        {
          title: 'ทักษะด้านการบริหารจัดการ',
          description:
            'ธรรมชาติของงานนี้จะต้องทำงานเป็นทีม จึงต้องมีทักษะในการบริหารจัดการทรัพยากรต่าง ๆ ทั้งคน เวลา และเครื่องมือ ให้สอดคล้องกับงบประมาณที่มี รวมไปถึงรู้วิธีที่จะบริหารจัดการกับทุกปัญหา',
          imgSrc: 'esports-project-manager/บริหารจัดการ.png',
        },
        {
          title: 'ทักษะด้านการสื่อสารและภาษาอังกฤษ',
          description:
            'ควรมีทักษะในการสื่อสาร สามารถอธิบายเรื่องยาก ๆ ให้เข้าใจได้ง่าย เพื่อให้ทีมงานเข้าใจจุดประสงค์ ในการทำงานได้อย่างชัดเจน ส่วนทักษะด้านภาษาอังกฤษถือว่ามีความสำคัญเช่นกัน เพราะในงานจะต้องมีการประสานงานกับทีมงานหรือองค์กรในต่างประเทศด้วย',
          imgSrc: 'esports-project-manager/ภาษาต่างประเทศ.png',
        },
        {
          title: 'ทักษะการทำ Live Streaming',
          description:
            'เป็นทักษะและความรู้เกี่ยวกับเทคนิคในการถ่ายทอดสดทั้งภาพและเสียงผ่านแพลตฟอร์มออนไลน์ต่าง ๆ เนื่องจากเวลาออกอากาศจริง ความผิดพลาดและปัญหาทางเทคนิคมักจะเกิดขึ้นโดยที่ไม่คาดคิด จึงจำเป็นที่จะต้องมีความรู้ในด้านนี้เพื่อที่จะแก้ไขปัญหาที่เกิดขึ้นได้',
          imgSrc: 'esports-project-manager/ถ่ายทอด.png',
        },
        {
          title: 'ทักษะการคิดอย่างเป็นระบบ',
          description:
            'eSports Project Manager ควรมีทักษะการจัดกระบวนการคิดอย่างเป็นระบบ  และคิดอย่างเป็นเหตุและผล เป็นสิ่งสำคัญที่จะทำให้สามารถวางแผนงานที่ได้รับมอบหมายอย่างเป็นขั้นตอนและเกิดความเหมาะสม',
          imgSrc: 'esports-project-manager/คิดวิเคราะห์.png',
        },
        {
          title: 'ทักษะการทำงานเป็นทีม',
          description:
            'มีความเข้าใจบทบาทหน้าที่ของตนเองและรู้ถึงศักยภาพของสมาชิกในทีมเป็นอย่างดี ว่าใครมีความถนัดทางด้านไหน สามารถที่จะวางเป้าหมาย สั่งการและรู้วิธีที่จะทำให้ทุกคนปฏิบัติงานร่วมกันเพื่อไปถึงเป้าหมายนั้นได้อย่างเหมาะสม',
          imgSrc: 'esports-project-manager/ทำงานเป็นทีม.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/esports-project-manager/character.png"
      :characterDetails="[
        'มี Passion ในการเล่นเกม ชอบเล่นเกมหรือมีความสนใจในเกมเป็นพื้นฐาน',
        'มีมนุษยสัมพันธ์ ชอบเข้าสังคม เป็นคนที่เข้าถึงได้ง่ายและสามารถปรับตัวเข้ากับผู้คนได้ง่าย',
        'มีลักษณะเป็นผู้นํา (Leadership) มีความเด็ดเดี่ยว กล้าคิดกล้าตัดสินใจ และพร้อมที่จะรับฟังความคิดเห็นของผู้อื่นเสมอ',
        'มีความรับผิดชอบสูง',
        'ชอบเรียนรู้สิ่งใหม่ ๆ ทันต่อสถานการณ์การเปลี่ยนแปลงของสังคมและโลกอยู่เสมอ',
      ]"
      roleImg="@/assets/job/esports-project-manager/role.png"
      :roles="[
        {
          title: 'การจัดกิจกรรมการแข่งขัน eSports',
          description:
            'จะต้องการวางแผนจัดกิจกรรม ดูแลทัวร์นาเมนต์การแข่งขัน และประสานงาน',
        },
        {
          title: 'สื่อสารประชาสัมพันธ์กิจกรรมกีฬา eSports',
          description:
            'ทำคอนเทนต์เพื่อส่งเสริมภาพลักษณ์ให้ eSports เป็นที่ยอมรับมากขึ้น และสร้างคอมมูนิตี้ให้กับวงการกีฬา eSports',
        },
        {
          title: 'ควบคุมดูแลการถ่ายทอดสดการแข่งขันกีฬา eSports',
          description: 'ควบคุมดูแลการถ่ายทอดสดการแข่งขันกีฬา eSports',
        },
      ]"
      incomeDescription="รายได้โดยเฉลี่ย 40,000 - 100,000 บาท/เดือน และรายได้มีโอกาสที่จะสูงขึ้นไปเรื่อย ๆ ตามประสบการณ์ หากมีการทำงานล่วงเวลาก็จะมีรายได้ค่าจ้างทำงานล่วงเวลา (ขึ้นอยู่กับระเบียบของแต่ละองค์กร) ส่วนสวัสดิการก็จะได้รับตามมาตรฐานการทำงานทั่วไป"
      :recommendLv="[
        'เริ่มต้นสำรวจตัวเอง สนใจอะไร ชอบอะไร หรือมีความถนัดในเรื่องอะไร มีความชอบในเรื่องการเล่นเกมหรือไม่ หากชอบเกม ชอบประเภทไหน ชอบเกมเพราะแค่ความสนุกหรือต้องการที่จะเข้ามาเป็นส่วนหนึ่งในโลกของเกมด้วย',
        'หาจุดเชื่อมโยง จากความชอบ หรือสิ่งที่ตนเองถนัดนั้น จะนำไปสู่อาชีพที่เกี่ยวข้องกับเกมได้อย่างไร บางคนชอบเกม อาจจะเล่นไม่เก่งแต่ก็สามารถที่จะนำทักษะความรู้ในด้านอื่น ๆ ของตนเองเข้ามาทำประโยชน์ให้กับวงการเกมที่ตนเองรักได้',
        'ศึกษาหาความรู้ ศึกษาพัฒนาทักษะตนเองในด้านต่าง ๆ เพื่อที่จะนำความชอบต่อยอดไปสู่อาชีพ',
        'เตรียมใจที่จะอยู่กับโลกความเป็นจริง เพราะงาน eSports Project Manager ไม่ใช่การเล่นเกมเหมือนอย่างที่ใครหลายคนฝันไว้ ดังนั้นจึงต้องปรับทัศนคติของตนเองไว้ตั้งแต่เริ่มต้น ว่าแม้ไม่ได้เล่นเกมอย่างที่ชอบ แต่อย่างน้อยก็ยังได้ใกล้ชิดกับสิ่งที่รักและสนใจ นั่นคือ “เกม”',
        'ดูการแข่งขันกีฬา eSports อยู่เสมอ ศึกษากระบวนการและรูปแบบการจัดการแข่งขัน รวมไปถึงค้นหาไอเดียใหม่ ๆ สำหรับใช้เป็นแนวทางนำมาปรับประยุกต์ใช้กับการวางแผนงานของตนเองในอนาคต',
      ]"
      recommendCourseDescription="องค์ความรู้ที่จะนำเข้าสู่สายงาน eSports Project Manager นั้น ให้เน้นไปที่หลักสูตรหรือคณะที่สอนพัฒนาทักษะด้านกระบวนการคิดเชิงตรรกะเป็นหลัก เพราะงานสาขานี้ต้องใช้กระบวนการคิดอย่างเป็นระบบและการตัดสินใจที่ถูกต้องในการปฏิบัติงานอยู่เสมอ สำหรับหลักสูตรการเรียนการสอนที่ถือว่าเป็นประโยชน์และสามารถที่จะประยุกต์นำเข้ามาใช้ในสายนี้คืองานนี้ได้ก็จะเป็นหลักสูตรของคณะบริหารธุรกิจและคณะวิทยาการจัดการ โดยสาขาที่แนะนำก็คือ"
      recommendImg="@/assets/job/esports-project-manager/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: 'หลักสูตรคณะบริหารธุรกิจ สาขาการจัดการ (Management)',
          details: [],
        },
        {
          header: 'หลักสูตรคณะบริหารธุรกิจ สาขาการตลาด (Marketing)',
          details: [],
        },
        {
          header:
            'หลักสูตรคณะบริหารธุรกิจ สาขาการบริหารทรัพยากรมนุษย์ (Human Resources Management)',
          details: [],
        },
        {
          header:
            'นอกจากนั้นแล้วก็ยังมีหลักสูตรจากคณะนิเทศศาสตร์ สาขาวิชามัลติมีเดียดีไซน์และมีเดียอาร์ตที่สามารถนำมาปรับใช้กับสายงานนี้ได้อีกหนึ่งหลักสูตรด้วย',
          details: [],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'
import striptags from 'striptags'

export default Vue.extend({
  name: 'eSportsProjectManager',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/esports-project-manager/main.png'),
      title: 'ผู้จัดการแข่งขันอีสปอร์ต',
      subTitle: '(eSports Project Manager)',
      description:
        'eSports Project Manager จะเป็นสายงานที่รับผิดชอบดูแลและวางแผนในการจัดกิจกรรมการแข่งขันกีฬา eSports  ต้องมีการดูแลบริหารจัดการทรัพยากรหลายด้าน ทั้งบุคลากร อุปกรณ์ เวลา และงบประมาณ จึงจำเป็นที่จะต้องมีทักษะความสามารถที่หลากหลายรอบตัว',
    }
  },
  head() {
    const instance: any = this

    return {
      title: 'อาชีพเกมมาสเตอร์',
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: striptags(instance.description),
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
