<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/wkMLYsBQm6E"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription="เนื่องจากงาน GM นั้นมีความหลากหลายในสายงาน จึงต้องอาศัยทักษะที่หลากหลายด้วยเช่นกัน แต่ทักษะที่จำเป็นต้องมี ได้แก่"
      :skills="[
        {
          title: 'ความเชี่ยวชาญในเรื่องที่ตัวเองสนใจ',
          description:
            'ตามที่กล่าวข้างต้น GM แบ่งการทำงานออกเป็นหลายสายงาน ดังนั้น การทำงานจึงขึ้นอยู่กับว่า เรามีความรู้ความถนัดและเชี่ยวชาญในเรื่องอะไร อาทิ หากต้องการเป็น GM ด้านการตลาด ควรจะมีความรู้และทักษะด้านการตลาด การวางแผนกลยุทธ์ต่างๆ หรือถ้าต้องการเป็น GM ด้านการขาย ก็ควรจะต้องมีทักษะในด้านจิตวิทยา รู้วิธีการโน้มน้าวใจคน เป็นต้น',
          imgSrc: 'game-master/เชี่ยวชาญเรื่องที่ตัวเองสนใจ.png',
        },
        {
          title: 'ทักษะในการสื่อสารและการทำงานเป็นทีม',
          description:
            'ในสายงาน GM นั้น แม้จะแบ่งแยกการทำงานตามสายงาน แต่ต้องทำงานร่วมกันอยู่ตลอดเวลา ดังนั้น ทักษะการสื่อสารและการทำงานเป็นทีมจึงเป็นเรื่องสำคัญที่จะต้องมี โดยสามารถอธิบายสิ่งที่ต้องการจะสื่อสารให้เข้าใจได้ง่ายที่สุด และจะต้องมีทักษะในการปรับตัวในการทำงานร่วมกันเป็นทีม',
          imgSrc: 'game-master/สื่อสาร.png',
        },
        {
          title: 'ทักษะทางด้านภาษา',
          description:
            'ทักษะด้านภาษาต่างประเทศทั้งการพูด เขียน และอ่านมีความสำคัญมาก เพราะต้องประสานงานกับต้นสังกัดผู้ผลิตและพัฒนาเกมที่อยู่ในต่างประเทศอยู่เสมอ รวมถึงภาษาไทยเช่นกัน เพราะจะต้องมีการสื่อสารกับผู้เล่นที่เป็นคนไทยโดยตรง ความยากก็คือ จะอธิบายอย่างไรให้ผู้เล่นไม่เกิดความสับสน โดยใช้ภาษาที่สั้น กระชับ และเข้าใจง่าย',
          imgSrc: 'game-master/ภาษาต่างประเทศ.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/game-master/character.png"
      :characterDetails="[
        'รู้จักตนเอง เข้าใจตนเองเป็นอย่างดีว่าชอบอะไร สนใจในเรื่องอะไร',
        'ชอบเรียนรู้สิ่งใหม่ ติดตามเทรนด์และเปิดรับความรู้ใหม่ๆ อยู่เสมอ',
        'ชอบความท้าทาย ตื่นตัวและรู้สึกดีเมื่อได้พบเจอกับสิ่งใหม่ๆ ที่ไม่คุ้นเคย',
        'เป็นนักแก้ปัญหา มีไหวพริบในการแก้ปัญหาและพร้อมรับมือกับปัญหาใหม่ๆ ที่เข้ามาอยู่เสมอ',
        'รักการบริการ รู้สึกดีและภูมิใจที่ได้มอบสิ่งดีๆ ให้กับผู้คน',
      ]"
      roleImg="@/assets/job/game-master/role.png"
      :roles="[
        {
          title: 'ให้บริการด้านเกม',
          description:
            'ให้บริการลูกค้า(ผู้เล่น)ในส่วนของการให้ข้อมูลเกม คำแนะนำ ดูแลความเรียบร้อยของเกม แก้ปัญหาให้กับผู้เล่น',
        },
        {
          title: 'สร้างความประทับใจ',
          description:
            'โดยนำเสนอการบริการแบบต่างๆ ผ่านเกม หรือผ่านแพลตฟอร์มต่างๆ ทั้งออฟไลน์และออนไลน์',
        },
        {
          title: 'Office hours',
          description: 'ชั่วโมงการทำงานเหมือนกับพนักงานบริษัททั่วไป',
        },
      ]"
      incomeDescription="รายได้ของอาชีพนี้โดยเฉลี่ยจะเริ่มต้นอยู่ที่ 20,000 บาทขึ้นไป และจะเพิ่มขึ้นไปตามประสบการณ์และตำแหน่งหน้าที่ความรับผิดชอบ ในส่วนของสวัสดิการก็จะเหมือนสายงานอื่นๆ ขึ้นอยู่กับนโยบายแต่ละบริษัท "
      :recommendLv="[
        'รู้จักตัวเอง ต้องรู้ว่าตัวเองมีความสนใจ มีความสามารถและถนัดอะไรบ้าง นอกเหนือไปจากเรื่องของเกม',
        'พัฒนาตัวเอง ฝึกฝนเรียนรู้เพิ่มพูนทักษะที่สนใจให้เกิดความเชี่ยวชาญ รวมถึงต้องเรียนรู้ในเรื่องของเกมควบคู่กันไปด้วย',
        'รู้จักประยุกต์ใช้ นำทักษะความรู้ความเชี่ยวชาญมาปรับประยุกต์ใช้สร้างประโยชน์ให้กับสิ่งที่รัก ซึ่งก็คือ “เกม” ตรงนี้จะช่วยทำให้ทุกสามารถทำงานนี้ได้อย่างมีความสุข',
      ]"
      recommendCourseDescription="GM เป็นสายงานที่มีหน้าที่ความรับผิดชอบที่หลากหลาย แยกไปตามทักษะความถนัดต่างๆ อาชีพนี้จึงถือว่าเป็นสายงานที่เปิดกว้าง รองรับความเชี่ยวชาญและความถนัดจากทุกสาขา การเลือกคณะในระดับอุดมศึกษาที่จะเรียนและมาทำงานทางด้านนี้จึงเปิดกว้างเช่นกัน ขึ้นอยู่กับว่าเราต้องการเข้ามาทำงานด้านไหนโดยเฉพาะหรือไม่ ยกตัวอย่างสายการเรียนที่สามารถเข้ามาทำงานในสายงานนี้"
      recommendImg="@/assets/job/game-master/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: '',
          details: [
            {
              place: 'คณะอักษรศาสตร์',
              courses: [
                'สาขาวิชาภาษาไทย',
                'สาขาวิชาภาษาอังกฤษ',
                'สาขาวิชาภาษาจีน',
                'สาขาวิชาภาษาญี่ปุ่น',
              ],
            },
            {
              place: 'คณะมนุษยศาสตร์',
              courses: [
                'สาขาวิชาจิตวิทยา',
                'สาขาวิชาการพัฒนาชุมชน',
                'สาขาวิชาสารสนเทศศึกษา',
              ],
            },
            {
              place: 'คณะศิลปศาสตร์',
              courses: ['สาขาวิชาจิตวิทยา', 'สาขาวิชาภาษาศาสตร์'],
            },
            {
              place: 'คณะพาณิชยศาสตร์และการบัญชี',
              courses: ['สาขาพาณิชยศาสตร์', 'สาขาการตลาด', 'สาขาสถิติ'],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'
import striptags from 'striptags'

export default Vue.extend({
  name: 'GameMaster',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/game-master/main.png'),
      title: 'เกมมาสเตอร์',
      subTitle: '(Game Master)',
      description:
        'Game Master หรือ GM เป็นอาชีพที่ทำงานอยู่ในทั้งเบื้องหน้าและเบื้องหลังของวงการเกม มีหน้าที่ในการบริหารจัดการให้ผู้เล่นเกมได้รับความสะดวกและความสนุกจากการเล่นเกมอย่างเต็มที่นั่นเอง โดยขอบเขตบทบาทหน้าที่ของ Game Master ได้แก่ เป็นผู้ให้บริการด้านต่างๆ ที่เกี่ยวข้องกับเกม เป็นสื่อกลางที่เชื่อมระหว่างผู้ให้บริการและผู้เล่นเข้าด้วยกัน เป็นผู้เล่นและผู้สร้างสังคมในเกม',
    }
  },
  head() {
    const instance: any = this

    return {
      title: 'อาชีพเกมมาสเตอร์',
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: striptags(instance.description),
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
