<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/GQmuTjt2cms"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription="Game Journalist มีหน้าที่รายงานข่าว เขียนข่าวและบทความ รวมถึงสัมภาษณ์บุคคลที่อยู่ในวงการเกม ดังนั้นจึงถือเป็นผู้ที่ต้องมีความรับผิดชอบในการนำเสนอความถูกต้อง เพื่อให้ผู้ที่ติดตามอ่านข่าวได้รับข้อมูลที่ถูกต้องและชัดเจน โดยคุณสมบัติและทักษะของอาชีพนี้ ได้แก่"
      :skills="[
        {
          title: 'มีความสามารถด้านภาษา',
          description: `ใช้ภาษาไทยได้อย่างถูกต้องสละสลวย มีคลังคำศัพท์ที่หลากหลาย รู้จักการใช้รูปประโยคที่ถูกต้องตามหลักการ โดยจะมีโอกาสเพิ่มมากขึ้นในสายอาชีพ ถ้ามีความรู้ด้านภาษาต่างประเทศ จะทำให้สามารถค้นคว้าหาข้อมูลเชิงลึกได้ และยังมีโอกาสในการสัมภาษณ์ชาวต่างชาติในวงการเกมและ<span style='white-space: nowrap'>อีสปอร์ต</span>ทำให้มีข่าวสารนำเสนอมากกว่า`,
          imgSrc: 'journalist/ภาษาต่างประเทศ.png',
        },
        {
          title: 'ทักษะด้านการเขียนและการจับใจความความสำคัญ',
          description:
            'สามารถถอดความจากบทสัมภาษณ์ที่ได้จากแหล่งข่าวมาเป็นตัวอักษร เพื่อถ่ายทอดต่อไปให้ผู้อ่านได้รับทราบข่าวสาร โดยต้องมีความครบถ้วน ถูกต้อง ชัดเจน มีความรอบคอบ ไม่บิดเบือนความเป็นจริงและไม่มีอคติในการนำเสนอข่าวด้วย',
          imgSrc: 'journalist/ทักษะการเขียน.png',
        },
        {
          title: 'มีความคิดสร้างสรรค์',
          description:
            'เข้าใจเลือกจับประเด็นข่าว เพื่อผลิตเนื้อหาข่าวหรือบทความให้น่าสนใจและน่าติดตามสำหรับผู้ชมและผู้ฟัง เนื่องจากปัจจุบันมีการแข่งขันค่อนข้างสูงทั้งในแง่ปริมาณข่าวและกระแสข่าว ดังนั้นเพื่อช่วงชิงพื้นที่ความสนใจจากผู้อ่านข่าว การสร้างสรรค์ประเด็นที่น่าสนใจและแตกต่างจึงเป็นสิ่งที่สำคัญมาก',
          imgSrc: 'journalist/ความคิดสร้างสรรค์.png',
        },
        {
          title: 'ทักษะอื่นๆ',
          description:
            'เช่น ทักษะด้านการสื่อสาร การรู้จักกาลเทศะ มารยาทในการเข้าสังคม เนื่องจากต้องออกไปพบกับผู้คนจำนวนมาก ทั้งบุคคลที่มีชื่อเสียง เพื่อขอสัมภาษณ์ ดังนั้นทักษะการเข้าสังคมก็เป็นสิ่งสำคัญที่จะทำให้แหล่งข่าวมีความสบายใจที่จะให้ข้อมูลที่นักข่าวเกมอยากได้ นอกจากนี้ ควรมีทักษะการถ่ายภาพ และการทำกราฟิก เพราะถือว่าเป็นประโยชน์และข้อได้เปรียบสำหรับการทำงานในปัจจุบัน',
          imgSrc: 'journalist/ทักษะอื่นๆ.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/streamer/character.png"
      :characterDetails="[
        'Extrovert ชอบเข้าสังคมและสื่อสารกับผู้อื่น',
        'รู้จักกาลเทศะ การวางตัวในแต่ละสถานการณ์',
        'ช่างสังเกต ช่างสงสัย ช่างสังเกต และชอบตั้งคำถาม',
        'ความคล่องตัวและทันต่อสถานการณ์',
        'กล้าแสดงออก กล้าพูด กล้าทำ ไม่เขินอาย',
      ]"
      roleImg="@/assets/job/journalist/role.png"
      :roles="[
        {
          title: 'ติดตามข่าวสาร',
          description: 'ความเคลื่อนไหวในวงการเกมและผลการแข่งขันอย่างสม่ำเสมอ',
        },
        {
          title: 'สัมภาษณ์',
          description: 'บุคลากรในแวดวงเกม เพื่อนำมาถ่ายทอดในรูปแบบต่างๆ',
        },
        {
          title: 'วิเคราะห์ข้อมูล',
          description: 'เพื่อนำมาสรุปออกเป็นข่าวหรือบทความ',
        },
        {
          title: 'ร่วมงานแข่งขันเกมและอีสปอร์ต ',
          description: 'ทั้งในประเทศและต่างประเทศ ',
        },
      ]"
      :incomeDescription="`
        รายได้เฉลี่ย 15,000-30,000 บาทต่อเดือน รายได้ สวัสดิการและสิทธิประโยชน์ของอาชีพนี้ มีรายละเอียดดังนี้
        <ol class='pl-4 mt-3 text-left' style='list-style-type:decimal'>
          <li>นักข่าววงการเกมประจำสำนักข่าว รายได้จะอยู่ที่ 25,000-30,000 บาทต่อเดือน และจะเพิ่มมากขึ้นตามประสบการณ์การทำงาน และได้รับสวัสดิการต่างๆ เช่น ประกันสังคม ค่าใช้จ่ายการออกภาคสนามทั้งในประเทศและต่างประเทศ ค่าเดินทาง ค่ารถ ค่าอาหาร</li>
          <li>นักเขียนบทความตามเพจหรือเว็บไซต์เกม รายได้จะอยู่ที่ 15,000-20,000 บาทต่อเดือน และจะเพิ่มมากขึ้นตามประสบการณ์การทำงาน ชื่อเสียง และจำนวนผู้ติดตามบนเพจด้วย และยังมีสวัสดิการอื่นๆ เช่น ประกันสังคมและประกันสุขภาพ</li>
          <li>นักเขียนบทความอิสระ (freelance) สามารถรับงานได้ตามอิสระ โดยรายได้จะขึ้นอยู่กับข้อตกลงของผู้จ้างงาน และความยากง่ายของบทความ ทั้งนี้ freelance จะไม่มีสวัสดิการเหมือนกับนักข่าวที่มีสังกัดบริษัท แต่มีข้อดีคือ สามารถเขียนข่าวให้สำนักข่าวหรือเว็บไซต์ใดก็ได้ และได้ใช้เวลาอย่างอิสระ</li>
        </ol>
      `"
      :recommendLv="[
        'ลองเขียนบทความสั้นๆ เริ่มต้นจากลองเขียนบทความเกี่ยวกับเกมหรือกีฬาอีสปอร์ต เช่น ข่าวรายงานผลการแข่งขันเกม RoV หรือทดลองสร้างเพจใน Facebook ของตัวเองที่เขียนบทความเกี่ยวกับเกมโดยเฉพาะ และดูว่ามีผู้ติดตามหรือข้อคิดเห็นต่างๆ ของผลงานการเขียนเป็นอย่างไร',
        'กล้าพูด กล้าแสดงออก เมื่อมีความสามารถและทักษะด้านการเขียนแล้ว สิ่งสำคัญคือ ฝึกฝนให้ตัวเองกล้าพูดและกล้าแสดงออก เพราะอาชีพนี้จำเป็นที่จะต้องสื่อสารกับผู้อื่นอยู่ตลอดเวลา',
        'ฝึกฝนภาษาต่างประเทศ หากมีความสามารถด้านภาษาจะมีความได้เปรียบในการนำเสนอข่าวและหาข้อมูล เนื่องจากข้อมูลข่าวสารส่วนมากมาจากเว็บไซต์ต่างประเทศ เมื่อเจอบทความที่มีเนื้อหาน่าสนใจก็สามารถนำมาแปลและเผยเพร่ต่อสาธารณะได้ด้วยตัวเอง ดังนั้นเยาวชนคนรุ่นใหม่และผู้ที่สนในอาชีพ Game Journalist ควรติดตามสถานการณ์และข่าวสารอยู่เป็นประจำ และเปิดใจเรียนรู้สิ่งใหม่ๆ เพื่อฝึกฝนและพัฒนาทักษะของตัวเองอยู่เสมอ',
      ]"
      recommendCourseDescription="อาชีพ Game Journalist มีทักษะที่จำเป็น ได้แก่ ทักษะทางด้านภาษาคือ มีความสามารถในการใช้ภาษาที่ถูกต้องและภาษาต่างประเทศ และทักษะทางด้านสื่อสารมวลชน เพื่อให้เข้าใจกระบวนการการสื่อสารสู่สาธารณชน"
      recommendImg="@/assets/job/journalist/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: 'ด้านภาษา',
          details: [
            {
              place: 'คณะอักษรศาสตร์',
              courses: [],
            },
            {
              place: 'คณะศิลปศาสตร์',
              courses: [],
            },
            {
              place: 'คณะมนุษยศาสตร์',
              courses: [],
            },
          ],
        },
        {
          header: 'ด้านสื่อสารมวลชน',
          details: [
            {
              place: 'คณะนิเทศศาสตร์',
              courses: [],
            },
            {
              place: 'คณะวารสารศาสตร์และสื่อสารมวลชน',
              courses: [],
            },
            {
              place: 'วิทยาลัยนวัตกรรม',
              courses: ['สาขาวิชาการสื่อสารเพื่อการจัดการนวัตกรรม'],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'
import striptags from 'striptags'

export default Vue.extend({
  name: 'Journalist',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/journalist/main.png'),
      title: 'นักข่าววงการเกม',
      subTitle: '(Game Journalist)',
      description: `มีลักษณะการทำงานเหมือนกับนักข่าวในสายอื่นๆ อาทิ สายการเมือง เศรษฐกิจ สังคม โดยทำหน้าที่นำเสนอข้อมูลข่าวสารที่เกี่ยวกับวงการเกมและ<span style="white-space: nowrap">อีสปอร์ต</span>ทั้งหมดแก่สาธารณะ ผ่านการเขียนข่าวจากการออกไปหาข้อมูล หรือเขียนบทสัมภาษณ์ บทความวิเคราะห์ต่างๆ เช่น รายงานผลการแข่งขันกีฬา<span style="white-space: nowrap">อีสปอร์ต</span> สัมภาษณ์โค้ชและทีมนักกีฬาที่ชนะการแข่งขัน ข่าวการเปิดตัวเกมใหม่ๆ ข่าวความร่วมมือระหว่างบริษัทเกมกับผู้พัฒนาเกม เป็นต้น โดยนำเสนอผ่านช่องทางออฟไลน์ เช่น หนังสือพิมพ์ นิตยสาร และช่องทางออนไลน์ เช่น เว็บไซต์ Facebook Youtube`,
    }
  },
  head() {
    const instance: any = this

    return {
      title: 'อาชีพนักข่าว',
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: striptags(instance.description),
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
