<template>
  <b-container fluid>
    <JobDetail
      :mainImg="mainImg"
      mainVideoLink="https://www.youtube.com/embed/wnbkEVgDkhk"
      :title="title"
      :subTitle="subTitle"
      :description="description"
      skillMainDescription="สำหรับนักการตลาดโดยทั่วไป จะมีทักษะความรู้เกี่ยวกับการทำการตลาดเป็นพื้นฐานอยู่แล้ว แต่ Game Marketer จะต้องมีความเข้าใจในธุรกิจเกม และการทำการตลาดออนไลน์เป็นอย่างดีอีกด้วย นอกจากนี้ ยังต้องมีทักษะในการบริหารงานอื่นๆ เพื่อให้การทำงานมีประสิทธิภาพเกิดความคล่องตัวมากที่สุด"
      :skills="[
        {
          title: 'พื้นฐานด้านการตลาด',
          description:
            'ขึ้นชื่อว่านักการตลาด คงหนีไม่พ้นการทำงาน เพื่อให้สินค้าและบริการตอบโจทย์ความต้องการของกลุ่มเป้าหมายมากที่สุด เพื่อให้เกิดการซื้อสินค้าและบริการอย่างต่อเนื่อง ดังนั้น Game Marketer จึงต้องมีทักษะในการคิดวิเคราะห์และวางแผนกลยุทธ์ทางการตลาดต่างๆ เพื่อสร้างให้เกิดคุณค่าในตัวเกมให้เป็นที่รู้จักและเลือกใช้บริการ',
          imgSrc: 'marketing/การตลาด.png',
        },
        {
          title: 'เข้าใจในธุรกิจเกม',
          description:
            'ปัจจุบันเกมออนไลน์มีรูปแบบที่หลากหลาย อาทิ Casual Game เล่นง่ายๆ เพื่อผ่อนคลาย เกมสะสมแต้ม เกมวางแผนกลยุทธ์ ที่สามารถแข่งขันเป็นกีฬาอีสปอร์ต เกมแนวผจญภัย เกมต่อสู้ ซึ่งมีคู่แข่งในตลาดจำนวนมาก ดังนั้นหากมีความเข้าใจในบริบทและสภาพแวดล้อมของธุรกิจเกมเป็นอย่างดี จะทำให้สามารถวางแผนการตลาดได้อย่างมีประสิทธิภาพมากยิ่งขึ้น',
          imgSrc: 'marketing/เข้าใจธุรกิจเกม.png',
        },
        {
          title: 'ภาษาต่างประเทศ',
          description:
            'โดยเฉพาะภาษาอังกฤษ เนื่องจากบริษัทเจ้าของลิขสิทธิ์เกมและธุรกิจส่วนมากเป็นของต่างประเทศ ทำให้กระบวนการทำงานต้องมีการสื่อสารกับชาวต่างชาติ ดังนั้นเพื่อให้การทำงานมีประสิทธิภาพมากขึ้น จึงต้องมีทักษะภาษาต่างประเทศ โดยเฉพาะภาษาอังกฤษและภาษาจีน',
          imgSrc: 'marketing/ภาษาต่างประเทศ.png',
        },
        {
          title: 'สามารถสื่อสารได้อย่างเชี่ยวชาญ',
          description:
            'เป็นพื้นฐานสำคัญสำหรับนักการตลาดทุกคน เพราะนักการตลาดจะต้องทำงานร่วมกับหน่วยงานทั้งภายในและภายนอกองค์กร เช่น ฝ่ายขายและบริการ ฝ่ายประชาสัมพันธ์ หรือพาร์ทเนอร์ทางธุรกิจ ดังนั้นเพื่อให้การประสานงานเป็นไปอย่างมีประสิทธิภาพ จึงต้องสามารถสื่อสารให้เกิดความเข้าใจในวัตถุประสงค์และเป้าหมายทางการตลาดที่ตรงกัน',
          imgSrc: 'marketing/สื่อสาร.png',
        },
        {
          title: 'มีความคิดสร้างสรรค์และเรียนรู้สิ่งใหม่อยู่เสมอ',
          description:
            'Game Marketer ต้องใช้ความคิดสร้างสรรค์ควบคู่ไปกับทักษะด้านการตลาดในการทำงาน เพื่อที่จะวางแผนและกำหนดกลยุทธ์การตลาดให้ประสบความสำเร็จตามเป้าหมายและนำหน้าคู่แข่งอยู่เสมอ เช่น วิธีการโปรโมทเกมออนไลน์ให้น่าสนใจ หรือการจัดงาน event ต่างๆ เพื่อสร้างให้เกิดความสัมพันธ์ระหว่างสังคมผู้เล่นเกมและตัวเกมออนไลน์เอง',
          imgSrc: 'marketing/ความคิดสร้างสรรค์.png',
        },
      ]"
      :hasUniqueSkill="false"
      characterChartImg="@/assets/job/marketing/character.png"
      :characterDetails="[
        'ชอบคิดและชอบวางแผน เพื่อกำหนดทิศทางในการทำการตลาด',
        'สนใจสิ่งที่เกิดขึ้นรอบตัว ช่างสังเกต สำรวจความสนใจของคนในสังคม เพื่อนำประเด็นมาประยุกต์ใช้ในการทำการตลาด',
        'ชื่นชอบเกมและเรื่องอื่นๆ ที่เกี่ยวข้อง มีความเข้าใจในตลาดเกมออนไลน์และติดตามข่าวสารอยู่เสมอ',
        'กระตือรือร้น พร้อมเรียนรู้สิ่งใหม่ เปิดใจรับสิ่งใหม่ และติดตามเทรนด์ต่างๆ อยู่เสมอ',
        'กล้าแสดงออก กล้าพูด กล้าทำ ไม่เขินอาย',
      ]"
      roleImg="@/assets/job/marketing/role.png"
      :roles="[
        {
          title: 'ติดตามข่าวสาร',
          description: 'เกม คู่แข่ง และเทรนด์ต่างๆ',
        },
        {
          title: 'วางแผนงาน',
          description: 'วิเคราะห์ปัญหาและคิดค้นแนวทางการแก้ไขปัญหา',
        },
        {
          title: 'ประชุมทีม',
          description:
            'เพื่ออัปเดตความคืบหน้าของงานปัญหาที่เกิดขึ้นและแลกเปลี่ยนความคิดเห็น',
        },
        {
          title: 'Office hours',
          description: 'ชั่วโมงการทำงานเหมือนกับพนักงานบริษัททั่วไป',
        },
      ]"
      incomeDescription="รายได้เฉลี่ย 18,000-350,000 บาทต่อเดือน สำหรับนักศึกษาจบใหม่ประมาณ 18,000-25,000 บาทต่อเดือน จากนั้นรายได้จะเพิ่มขึ้นตามประสบการณ์ ความสามารถ และระยะเวลา หากได้รับการเลื่อนขั้นไปทำงานในตำแหน่งบริหารก็จะทำให้รายได้เพิ่มขึ้น สำหรับสิทธิประโยชน์ต่าง ๆ ขึ้นอยู่กับบริษัทที่ทำงาน เช่น ประกันสังคม ประกันสุขภาพ ค่ารักษาพยาบาล วันหยุดพักร้อน และหลักสูตรการอบรมทักษะ เป็นต้น"
      :recommendLv="[
        'รู้จักตัวเอง ค้นหาความชื่นชอบและความต้องการของตัวเองให้เจอ เช่น มีความรู้ด้านการตลาด แต่ในเวลาส่วนตัวชอบเล่นเกม ชอบศึกษาเกี่ยวกับเกม ทำให้ใช้ความสามารถและความชื่นชอบในเกมที่มีมาใช้ในงานด้านการตลาดเกม เป็นต้น',
        'ลองสัมผัสกับตัวเกม ลองเล่นเกมแต่ละประเภท เพราะการเล่นเกมที่หลากหลาย จะทำให้เข้าใจความแตกต่างของแต่ละเกม เช่น วิธีการเล่น กราฟิก เพื่อนำไปเป็นข้อมูลในการทำงาน',
        'หาแรงบันดาลใจและเรียนรู้สิ่งใหม่ เปิดใจเรียนรู้สิ่งใหม่ๆ โดยสามารถหาข้อมูลข่าวสารต่างๆ ได้ผ่านช่องทางออนไลน์ โซเชียลมีเดีย ซึ่งจะช่วยให้เข้าใจในบริบทที่เปลี่ยนแปลงและนำมาปรับใช้ในการทำงานได้',
      ]"
      recommendCourseDescription="การเรียนในสาขาวิชาการตลาด บริหารธุรกิจ จะทำให้ผู้ที่สนใจประกอบอาชีพ Game Marketer มีพื้นฐานความรู้ที่สามารถนำมาปรับใช้ได้เลยเมื่อเริ่มต้นทำงาน ทั้งนี้อาจจะมีผู้ที่เรียนจบจากสาขาวิชาอื่นๆ ไม่ตรงสายแต่ยังมีความเกี่ยวข้องกับการทำธุรกิจก็สามารถที่จะประกอบอาชีพนี้ได้เช่นกัน สำหรับผู้ที่สนใจสาขาวิชาที่เกี่ยวข้องกับงานด้านการตลาด มีดังต่อไปนี้"
      recommendImg="@/assets/job/marketing/recommend-course.png"
      :recommendCourseDetails="[
        {
          header: 'ด้านการตลาด',
          details: [
            {
              place: 'คณะบริหารธุรกิจ',
              courses: ['สาขาวิชาการตลาด'],
            },
            {
              place: 'คณะพาณิชยศาสตร์และการบัญชี  ',
              courses: ['สาขาวิชาการตลาด'],
            },
          ],
        },
        {
          header: 'ด้านภาษา',
          details: [
            {
              place: 'คณะศิลปศาสตร์',
              courses: [
                'โครงการการสื่อภาษาอังกฤษเชิงธุรกิจ (หลักสูตรภาษาอังกฤษ)',
                'สาขาวิชาภาษาไทยและสาขาวิชาภาษาอังกฤษ',
                'สาขาวิชาภาษาอังกฤษธุรกิจ',
              ],
            },
            {
              place: 'คณะอักษรศาสตร์',
              courses: [],
            },
            {
              place: 'คณะมนุษยศาสตร์',
              courses: [],
            },
          ],
        },
        {
          header: 'ด้านสื่อสารมวลชน',
          details: [
            {
              place: 'คณะนิเทศศาสตร์',
              courses: [
                'สาขาวิชาการผลิตเนื้อหาสร้างสรรค์และประสบการณ์ดิจิทัล',
                'สาขาวิชา Communication Strategy and Ideation (หลักสูตรนานาชาติ)',
                'ภาควิชาสื่อสารมวลชน (หลักสูตรภาษาไทย)',
                'ภาควิชาการจัดการการสื่อสาร (หลักสูตรนานาชาติ)',
              ],
            },
            {
              place: 'คณะวารสารศาสตร์และสื่อสารมวลชน  ',
              courses: ['สาขาวิชาบริหารการสื่อสาร'],
            },
          ],
        },
      ]"
    />
  </b-container>
</template>

<script lang="ts">
import Vue from 'vue'
import JobDetail from '../../../components/job/JobDetail.vue'

export default Vue.extend({
  name: 'Marketing',
  components: {
    JobDetail,
  },
  data() {
    return {
      mainImg: require('@/assets/job/marketing/main.png'),
      title: 'นักการตลาดด้านเกม',
      subTitle: '(Game Marketer)',
      description:
        'ทำหน้าที่ดูแลวางแผนการตลาดให้กับธุรกิจเกมโดยเฉพาะ โดยมีลักษณะการทำงานเหมือนกับนักการตลาดในธุรกิจอื่นๆ คือ ทำให้สินค้าหรือบริการเป็นที่รู้จัก ตรงตามความต้องการ สร้างความพึงพอใจให้แก่กลุ่มเป้าหมายและเกิดการใช้ซ้ำอย่างต่อเนื่อง ด้วยการบริหารจัดการด้านต่างๆ เพื่อก่อให้เกิดรายได้ต่อธุรกิจ แต่นักการตลาดด้านเกมจะต้องมีความรู้ความเชี่ยวชาญเฉพาะทาง โดยเฉพาะความเข้าใจรสนิยมและความต้องการของกลุ่มเป้าหมาย เนื่องจากเกมออนไลน์มีการให้บริการบนแพลตฟอร์มออนไลน์เป็นหลัก จึงจำเป็นที่จะต้องมีความรู้ด้านการทำการตลาดออนไลน์ด้วย โดยเริ่มตั้งแต่ขั้นตอนการวางแผน วิจัย พัฒนากลยุทธ์การตลาด สื่อสารไปยังกลุ่มเป้าหมายจนไปถึงประเมินผลทางการตลาด อาชีพนี้ถือว่าเป็นอาชีพที่มีการแข่งขันค่อนข้างสูง ดังนั้นนักการตลาดจึงต้องใช้ทักษะ ประสบการณ์ และความคิดสร้างสรรค์ เพื่อให้บรรลุเป้าหมายทางการตลาดที่ตั้งไว้ Game Marketer จึงถือเป็นผู้ที่ผลักดันให้อุตสาหกรรมเกมเป็นที่รู้จักในสังคมวงกว้าง',
    }
  },
  head() {
    const instance: any = this

    return {
      meta: [
        { property: 'og:type', content: 'article' },
        {
          property: 'og:title',
          hid: 'og:title',
          content: instance.title + ' ' + instance.subTitle,
        },
        {
          property: 'og:description',
          hid: 'og:description',
          content: instance.description,
        },
        { property: 'og:image', hid: 'og:image', content: instance.mainImg },
      ],
    }
  },
})
</script>

<style lang="scss" scoped></style>
